{
  "type": "generic",
  "id": "safety-regulations-for-the-bodywork-AQS315",
  "title": "Safety Regulations for the Bodywork",
  "htmlContent": "<div class=\"content\">\n\r\n<table width=\"100%\" >\r\n  <!--XPRINT-->\r\n  <table>\r\n  <tr>\r\n    <td></td>\r\n   <td>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</td>\r\n  \t\r\n  </tr>\r\n  </table>\r\n  \r\n  <!--/XPRINT-->\r\n  <tr>\r\n    <td >\n<p class=\"title\">Safety Regulations for the Bodywork</p>\n\n<p class=\"topic\">10.1 General</p>\n\n<ul type=\"disc\">\n<li>Most operations are shown in the form of illustrations.\nExplanatory text has been added only at points where instructions\nare important to proper and appropriate repair.</li>\n\n<li>The illustrations with the inserted operational instructions\nshow the order of the operations. No special reference is made to\nrepeated standard operations such as cutting operations or grinding\nconnecting surfaces down to the bare metal, since the Aftersales\ncompanies are aware of these operations.</li>\n\n<li>The repair methods specified in module A must be complied with\nin areas in which both cutting and connecting operations affect the\nstrength and roadworthiness of the body.</li>\n</ul>\n\n<p class=\"topic\">10.2 Repair Information &ndash; Preparation</p>\n\n<ul type=\"disc\">\n<li>For the prevention of fire and explosive hazards in conjunction\nwith drilling, cutting, grinding or welding operations and material\nprocessing, the appropriate guidelines and regulations with regard\nto accident prevention issued by the specific national authorities\nmust be observed. This is especially applicable to natural\ngas-driven vehicles.</li>\n\n<li>No holes may be drilled in the underbody area from the interior\nof on gas-driven vehicles. This is indicated by the stickers\n\"Caution, tank system: drilling / grinding prohibited\" in the\nvehicle interior and on the cover for the pressurised gas tanks.\nThe presence / absence of such stickers does not replace the need\nto establish the location of the tank system before starting\ndrilling and grinding work. If there are no stickers in the\nappropriate places, these must be applied.</li>\n\n<li>Pressurised gas tanks with carrier frames, gas lines as well as\nall natural gas-bearing components must always be removed when\nperforming operations involving the generation of significant\namounts of heat, e.g. cutting, grinding, soldering or welding,\nworking with hot-air blowers or cutting torches etc., at a distance\nof &lt;= 1 metre from these components.</li>\n\n<li>All other natural gas system components must be completely\ndischarged and flushed with inert gas.</li>\n\n<li>During any cutting, grinding, soldering or welding operations,\nit must be ensured that a suitable device for extracting vapours\nand dust particles is available. This is especially applicable to\ngalvanised body components. Additional protection is required for\nflying sparks.</li>\n\n<li>Always wear protective goggles and a dust mask during cutting,\ngrinding or welding operations and material machining.</li>\n\n<li>Follow storage instructions on container packages when storing\nsolvent-containing substances &ndash; fire hazard.</li>\n\n<li>Avoid naked flames.</li>\n\n<li>Fire extinguishers must be available in adequate numbers and\nroutinely serviced.</li>\n\n<li>Observe environmental and health protection regulations.</li>\n\n<li>For the sake of fire prevention, never apply protective\nmaterials to or in the immediate vicinity of components near the\nengine and exhaust system (e.g. catalytic converter, oxygen\nsensor).</li>\n\n<li>The fuel tank and fuel pipes must always be removed if welding\noperations are performed near these components &ndash; danger of\nexplosion.</li>\n\n<li>Following accidents indicating considerable stress on the\nchassis, the following components in particular should be checked,\nindependently of checking chassis alignment, which should be\ncarried out in all cases:</li>\n\n<li>Ensure proper operation of steering and steering linkage\nthrough the entire steering angle. Visual check for deformation and\ncracks.</li>\n\n<li>In addition, check the chassis and all related components for\ndeformation and cracks, including spring struts, steering knuckles,\ncontrol arms, axle bodies, stabilisers and associated fastening\nparts.</li>\n\n<li>Visually check wheel rims and tyres for damage, for cuts in\ntread and side walls, and for true running and balance.</li>\n\n<li>All components that have been loosened or removed during repair\nwork must be re-fastened at their original installation locations.\nReplace damaged components (e.g. micro-encapsulated bolts) with new\nparts.</li>\n\n<li>Always attach the earth terminal of the welding equipment to\nthe immediate vicinity of the welding point. Ensure perfect ground\nconnections.</li>\n\n<li>Before operations involving a risk of electrical short circuit,\nthe ground cable must be disconnected from the battery. This also\napplies for welding and soldering work on the vehicle.</li>\n\n<li>Control units may be damaged at temperatures above 80\n&deg;C/176 &deg;F.</li>\n\n<li>During soldering, welding and straightening work in the\nimmediate vicinity of sensitive components (e.g. electrical/\nelectronic/ pyrotechnical components, control units, wiring\nharnesses and air conditioning components) the components must be\nremoved. If minor assembly or bodywork operations are being\nperformed (no use of slide hammer, for example) it is sufficient to\nswitch the ignition OFF. When repair work is being carried out in\nthe vicinity of airbag system sensors, the sensors must be checked\nfor damage and replaced if necessary. Remove ignition key and keep\nin a safe place during start-up.</li>\n\n<li>Example for the removal of airbag components / sensors:</li>\n\n<ul type=\"circle\">\n<li>Area of airbag sensors on upper front of vehicle, front doors\nor door pillars / B-pillars on vehicles with side airbag sensors in\nfront doors.</li>\n\n<li>In vicinity of roof and upper rear quarter panel including A,\nB, C and D-pillars for vehicles with curtain airbag.</li>\n</ul>\n</ul>\n\n<p class=\"topic\">10.3 Repair Information &ndash; General</p>\n\n<ul type=\"disc\">\n<li>Never grind or smooth butt welds / solder joints at frame\nparts.</li>\n\n<li>For proper repair of accident-damaged vehicles, the body\nmeasurement / alignment systems recommended by Opel / Vauxhall must\nbe used.</li>\n\n<li>Since all welded /soldered parts (primary and secondary frames)\n&ndash; especially in the area of the floor frame group &ndash; are\nof paramount importance to the driving, operating and, above all,\naccident safety (deformation characteristics) of the vehicle, the\nspecified cutting points, weld seam formations and jointing\nprocesses must be performed according to the specifications in the\nService Instructions.</li>\n\n<li>Body sheet metal parts and body members (underbody) are made of\ncold-workable, deep-drawn sheet steel in standard production.\nDamaged parts must be cold when restoring them to their original\nshape.</li>\n\n<li>B-pillar reinforcements of high tempered PHS steel must not be\nground!</li>\n\n<li>If any deformities are present in the primary and secondary\nbearer areas, the repair must always be carried out using body\nmeasuring and aligning systems.</li>\n\n<li>Only when these preconditions are fulfilled can a correct\ndiagnosis be made for establishing the proper repair\nprocedure.</li>\n\n<li>The separating points, welding/solder seam forms and jointing\nmethods specified must be implemented with particular care in order\nto restore the original strength conditions. For inert gas welding\n(MAG), active inert gases must be used such as carbon dioxide and\nmixed gases with high argon proportion and mixtures of oxygen and\ncarbon dioxide. For soldering, the original CiSi3 solder wire must\nbe used as the solder parameters of the equipment are set to\nthis.</li>\n\n<li>The required electrode contact pressure during resistance spot\nwelding using handheld spot welding tongs is inadequate when using\nelectrode holders that are longer than 40 cm.</li>\n\n<li>The welders, types and parameters recommended by Opel/Vauxhall\nmust be used.</li>\n\n<li>The weld point adhesive recommended by Opel/Vauxhall must be\nused.</li>\n</ul>\n\n<p class=\"topic\">10.4 Repair Information &ndash; Corrosion\nProtection</p>\n\n<ul type=\"disc\">\n<li>In order to ensure that long-term protection after repairs or\npart replacement is also guaranteed in Aftersales, the damaged area\nmust be treated with cavity preservation.</li>\n</ul>\n\n<p>Important guidelines for restoration of the original corrosion\nprotection:</p>\n\n<ul type=\"disc\">\n<li>Clean the welding points (spot-welded galvanised body panels\nhave only minimal erosion around the welding spot).</li>\n\n<li>Always apply spot-weld paint to both sides of the welding\nflange.</li>\n\n<li>Prime bare metal points immediately after repair work.</li>\n\n<li>Use sealing compound to protect sheet metal overlaps, abutting\njoints, flanges and welding seams.</li>\n\n<li>Seal with protective wax following repair work. Water drains in\nthe A, B, C, D-pillars, in the rear quarter panelling and in the\narea of the floor group must remain intact and free of dirt and\nsealing compound.</li>\n\n<li>Always apply sprayable seam seal to primed and cured\nsurfaces.</li>\n\n<li>The welding procedures appearing in the various operations are\nidentified by welding symbols.</li>\n\n<li>There is no difference between the welding of body untreated\ndeep drawn sheet metal and of alloy-galvanised sheet metal.</li>\n\n<li>Spot welding is the preferred procedure for alloy-galvanised\nsheet metal.</li>\n\n<li>Remove all paint layers from welding and soldering points.</li>\n\n<li>Use corrosion protection materials from \"Aftersales\".</li>\n\n<li>Grind bare adhesive surfaces of new part with KTL primer in\nvicinity of spot-welds only (also applies to galvanised sheet metal\nparts).</li>\n\n<li>Perforating punches (plug welding) are not to be used for\nmaterials thicker than 1 mm. For new-part material thicker than 1\nmm, use a drill preparatory to plug welding.</li>\n\n<li>For material thicknesses up to 3 mm, optionally inert gas\nsoldering or spot-welders may be used for joining - see\ncorresponding Service Instruction.</li>\n\n<li>Always apply spot weld paint between the connection flanges.\nPerform a test weld prior to welding in new parts.</li>\n\n<li>For any cutting, grinding, soldering or welding operations,\napply heat barrier paste in the area of adhesive and sealant\nmaterials to protect the adhesive against burning.</li>\n\n<li>Do not apply spot weld paint to bare-ground adhesive\nflanges.</li>\n\n<li>Remove PVC underseal / sealant materials in the area of the\nwheel housing using hot air or rotating wire brush.</li>\n\n<li>Use plastic or wire brush to remove paint and primer.</li>\n\n<li>Do not use thermal cutting processes (cutting torch/plasma\nburner) for cutting operations.</li>\n</ul>\n\n<p class=\"topic\">10.5 Repair Information &ndash; Galvanised Sheet\nMetal Parts</p>\n\n<ul type=\"disc\">\n<li>To reduce zinc-layer damage in cutting areas to a minimum,\npreference should be given to mechanical cutting processes (e.g.\nspot weld drill, body saw).</li>\n\n<li>Preparation and welding: Do not use spot weld paint for\ncemented and welded flanges (incompatibility/loss of\nadhesion).</li>\n\n<li>Grind new parts at welding points only (high-grade galvanised\nnew parts with KTL primer are thus preserved).</li>\n</ul>\n\n<p class=\"topic\">10.6 Repair Information &ndash; Cemented Glass\nPanes</p>\n\n<ul type=\"disc\">\n<li>Refer to corresponding tables in the Service Instructions for\nlay-over times for freshly cemented glass panes.</li>\n</ul>\n\n<ul type=\"none\" class=\"none\">\n<li>For reasons of safety and quality, it is necessary to maintain\nvehicle lay-over times after cementing glass panes in Service - see\ncorresponding Service Instruction.</li>\n</ul>\n\n<ul type=\"disc\">\n<li>Cement in glass pane at room temperature (18 &deg;C/64 &deg;F\nto 28 &deg;C/82 &deg;F) and under dust-free conditions.</li>\n</ul>\n</td>\r\n  </tr>\r\n  \r\n  <tr>\r\n    <td ></td>\r\n  </tr>\r\n</table>\r\n</div>",
  "extractedData": {}
}