{
  "type": "generic",
  "id": "safety-regulations-for-steering-systems-AQS315",
  "title": "Safety Regulations for Steering Systems",
  "htmlContent": "<div class=\"content\">\n\r\n<table width=\"100%\" >\r\n  <!--XPRINT-->\r\n  <table>\r\n  <tr>\r\n    <td></td>\r\n   <td>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</td>\r\n  \t\r\n  </tr>\r\n  </table>\r\n  \r\n  <!--/XPRINT-->\r\n  <tr>\r\n    <td >\n<p class=\"title\">Safety Regulations for Steering Systems</p>\n\n<ul type=\"disc\">\n<li>During operations where there is the risk of an electrical\nshort circuit, disconnect the ground cable from the battery.</li>\n\n<ul type=\"circle\">\n<li>Only Corsa-C as of Model Year 2004 and Meriva-A: In vehicles\nwith ESP, the steering angle sensor must be recalibrated after\ndisconnecting the battery - switch ignition ON and turn steering\nwheel from the right to the left stop.</li>\n</ul>\n\n<li>Bolted connections with designated angle of rotation specified\nin the Service Instructions (anti-fatigue bolts) must be replaced\nwith new parts if removed.</li>\n\n<li>The inner thread of screw connections that have been used with\nsealing compound must be recut and the outer thread cleaned. Used\nscrews with sealing compound. Always replace self-locking\nnuts.</li>\n\n<li>Never heat-treat steering components; potential alterations of\nthe material properties can otherwise adversely affect the\noperational safety of the vehicle.</li>\n\n<li>When working on the steering (steering gear, track rods,\nsteering column etc.) the steering must in the straight-ahead\nposition during removal and assembly.</li>\n\n<li>When removing the steering wheel, lock the steering column in\nthe \"straight ahead\" position to avoid destroying the contact\nunit/CIM during subsequent reinstallation of contact unit/CIM and\nsteering wheel.</li>\n\n<li>If the driver airbag has been deployed, the steering wheel,\nsteering column and steering column attachment must be subjected to\na function test and inspection and replaced if damaged.</li>\n\n<li>Only use approved special fluids &ndash; never re-use drained\nfluid.</li>\n</ul>\n\n<p>Following an accident, the following components should be\nvisually checked for bending and cracks, independently of the\nchassis alignment check, which should always be performed:</p>\n\n<ul type=\"disc\">\n<li>The chassis and all related components, such as spring strut,\nsteering knuckle, control arm, axle body, stabilisers and\nmiscellaneous fastening parts.</li>\n\n<li>Steering and steering linkage. In addition, check for correct\noperation through the entire steering angle.</li>\n</ul>\n</td>\r\n  </tr>\r\n  \r\n  <tr>\r\n    <td ></td>\r\n  </tr>\r\n</table>\r\n</div>",
  "extractedData": {}
}