{
  "type": "generic",
  "id": "safety-regulations-for-air-conditioning-systems-AQS315",
  "title": "Safety Regulations for Air Conditioning\nSystems",
  "htmlContent": "<div class=\"content\">\n\r\n<table width=\"100%\" >\r\n  <!--XPRINT-->\r\n  <table>\r\n  <tr>\r\n    <td></td>\r\n   <td>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</td>\r\n  \t\r\n  </tr>\r\n  </table>\r\n  \r\n  <!--/XPRINT-->\r\n  <tr>\r\n    <td >\n<p class=\"title\">Safety Regulations for Air Conditioning\nSystems</p>\n\n<p class=\"topic\">2.1 General</p>\n\n<ul type=\"disc\">\n<li>Operations on air conditioning systems must be performed by\ncertified, trained and qualified personnel. This is assured at all\nOpel/Vauxhall affiliated dealerships.</li>\n\n<li>Do not work on the refrigerant circuit in the workshop pit\nsince gaseous refrigerant is heavier than air and can thus collect\nin high concentrations in the pit.</li>\n\n<li>The workplace must be well ventilated.</li>\n\n<li>Liquid refrigerant that has evaporated under atmospheric\npressure may cause freezing if it comes into contact with parts of\nthe body. Do not point quick-release mechanism in direction of body\nwhen removing service hoses - residual refrigerant may emerge.</li>\n\n<li>Refrigerant must not be exposed to naked flames or incandescent\nbodies (e.g. during welding operations). Burning refrigerant\nreleases respiratory poisons.</li>\n\n<li>Wear suitable protective goggles and gloves when working on the\nrefrigerant circuit.</li>\n\n<li>Rubbing of the eyes must be avoided if contact with evaporating\nrefrigerant occurs. Rinse eyes and other affected parts of the body\nwith large amounts of cold water for several minutes and then seek\nimmediate medical attention.</li>\n\n<li>Keep refrigerant bottles away from direct heat (e.g. incident\nsolar radiation) and avoid temperatures in excess of 50 &deg;C/122\n&deg;F &ndash; risk of explosion.</li>\n\n<li>When filling refrigerant bottles, the specifications on the\nindividual bottles concerning maximum permissible weight must be\nobserved. Otherwise there is a danger of explosion.</li>\n\n<li>Always reseal refillable refrigerant bottles immediately when\nnot in use. Seal the cut-off valve and safety plug with a screw cap\nto protect these parts from damage &ndash; danger of injury.</li>\n\n<li>Never interchange or mix different types of refrigerant.</li>\n\n<li>When cleaning the engine compartment using a high pressure /\nsteam cleaner, do not direct the jet directly onto air conditioning\nsystem components.</li>\n\n<li>The air conditioning system must be evacuated before carrying\nout painting work during which the vehicle is present in the drying\noven for more than 20 minutes at temperatures exceeding 80\n&deg;C.</li>\n\n<li>PAG oil (compressor lubricant) is extremely hygroscopic and\nmust be stored in an air-sealed container.</li>\n\n<li>It is not permitted to re-use compressor lubricant.</li>\n\n<li>When replacing components of the refrigerant circuit, e.g.\nlines, receiver-dryer, evaporator or compressor, the separation\npoints must be sealed in order to prevent moisture entering the\nrefrigerant circuit.</li>\n\n<li>A completely or partially assembled system must not be left\nunconnected for any longer than is absolutely necessary.</li>\n\n<li>When testing the function of heating, ventilation and AC\nsystems, never reach into the mechanical components of the heating\nor AC system.</li>\n\n<li>The basic setting of the expansion valve must not be\nchanged.</li>\n</ul>\n\n<p class=\"topic\">2.2 Repair Information</p>\n\n<ul type=\"disc\">\n<li>Repairs to the air conditioning are to be performed immediately\nafter evacuation, as otherwise refrigerant in the system can\nevaporate causing a build-up of pressure &ndash; danger of\ninjury.</li>\n\n<li>Connections with missing catches and parts that have been\npenetrated by dirt, grease or dampness must not be installed. Only\ninstall pipes, hoses and units if the connections are in perfect\ncondition.</li>\n\n<li>In order to equalise temperatures and prevent moisture from\ncondensing, the AC components must be at room temperature before\ninstallation.</li>\n\n<li>Only remove sealing caps (plugs) immediately before connecting\nthe fitted parts. Keep the sealing caps of new parts for use in\nlater maintenance operations.</li>\n\n<li>When replacing components of the refrigerant circuit (e.g.\nlines, receiver-dryer, evaporator) the compressor lubricant\nremaining in the removed component must be replaced by new\ncompressor lubricant when refilling the refrigerant circuit.</li>\n\n<li>The receiver-dryer must not be connected until all other parts\nof the system have been connected.</li>\n\n<li>Use new O-rings.</li>\n\n<li>When using green O-rings: coat all O-rings with the fuel that\nis specified in the work operations before assembling.</li>\n\n<li>Compressor connections must be sealed immediately after\nremoving the compressor. In warranty cases, returned compressors\nwhich have not been sealed cannot be accepted.</li>\n\n<li>For depressurised refrigerant lines/systems, it is essential\nthat the receiver-dryer cartridge is replaced.</li>\n\n<li>Only use vehicle-specific synthetic compressor lubricants\napproved by Opel/Vauxhall &ndash; otherwise, damage to the\ncompressor may result.</li>\n</ul>\n\n<p class=\"bold\">Run-in Procedure</p>\n\n<p>The following run-in procedure must be observed after installing\na new compressor:</p>\n\n<ul type=\"disc\">\n<li>Open all the air vents on the instrument panel.</li>\n\n<li>Start vehicle engine and allow idle speed to stabilise (approx.\n5 secs.).</li>\n\n<li>Switch fan to maximum speed.</li>\n\n<li>Switch on AC system and allow to run continuously for at least\n2 minutes at an engine speed below 1500 rpm.</li>\n</ul>\n</td>\r\n  </tr>\r\n  \r\n  <tr>\r\n    <td ></td>\r\n  </tr>\r\n</table>\r\n</div>",
  "extractedData": {}
}