{
  "type": "generic",
  "id": "axle-constructions-front-axle-A26D1C",
  "title": "Axle constructions - front axle",
  "htmlContent": "<div class=\"content\">\n\r\n<table width=\"100%\" >\r\n  <!--XPRINT-->\r\n  <table>\r\n  <tr>\r\n    <td></td>\r\n   <td>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</td>\r\n  \t\r\n  </tr>\r\n  </table>\r\n  \r\n  <!--/XPRINT-->\r\n  <tr>\r\n    <td >\n<p class=\"title\">Axle constructions - front axle</p>\n\n<p class=\"topic\">Double-wishbone axle</p>\n\n<p>The double-wishbone axle is mainly used on the front axle. On\nvery sporting vehicles, this form of axle is also sometimes used on\nthe rear.</p>\n\n<p>The suspension arms are normally triangular. Therefore they are\nalso called wishbones. The wishbones are mounted on the axle body\nor vehicle body in two rotary joints, while the outer corner is\nheld by the steering knuckle at the top and bottom. The connecting\nelements between the steering knuckle and wishbone are usually ball\njoints. The purpose of these joints is to allow the vertical\nmovements of the steering knuckle on springing, and horizontal\nmovement on steering.</p>\n\n<p>The advantages of double wishbone axles is the very precise\nwheel guide and multiple adjustment possibilities. Depending on\narrangement (e.g. symmetrical arrangement, tilt change) or change\nin length ratio (trapezoidal link) of the wishbones, various\ndriving properties can be influenced positively.</p>\n\n<p class=\"topic\">Spring strut type axle (MacPherson)</p>\n\n<p>The development of the McPherson-spring strut-axle is based on\nthe design of the double-wishbone axle. The upper wishbone has been\nreplaced by a complete spring strut. The lower part of spring strut\nis connected directly to the steering knuckle (welded or screwed),\nthe upper part is screwed onto the vehicle body (dome). The lower\ncrossmember in the double-wishbone axle is retained in the\nMcPherson-spring strut-axle.</p>\n\n<p>The following depicts the different spring strut type axles used\nin Opel/Vauxhall vehicles.</p>\n</td>\r\n  </tr>\r\n  \r\n  <tr>\r\n    <td ></td>\r\n  </tr>\r\n</table>\r\n</div>",
  "extractedData": {}
}