{
  "type": "generic",
  "id": "general-information-A26D1C",
  "title": "General Information",
  "htmlContent": "<div class=\"content\">\n\r\n<table width=\"100%\" >\r\n  <!--XPRINT-->\r\n  <table>\r\n  <tr>\r\n    <td></td>\r\n   <td>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</td>\r\n  \t\r\n  </tr>\r\n  </table>\r\n  \r\n  <!--/XPRINT-->\r\n  <tr>\r\n    <td >\n<p class=\"title\">General Information</p>\n\n<p class=\"bold\">OPEL/VAUXHALL SERVICE PLAN</p>\n\n<p>This publication contains the Service information for:</p>\n\n<ul type=\"disc\">\n<li>Opel Speedster/Vauxhall VX220 vehicles as of Model Year\n2001.</li>\n</ul>\n\n<p>This edition, issued on CD-ROM and as a printed brochure\nreplaces all previous editions.</p>\n\n<p>The Opel/Vauxhall Service Plan is applicable world-wide.\nFeatures specific to individual countries, such as deviating legal\nrequirements or checks, cannot be covered in detail and are not\nincluded in this publication. Where appropriate, separate\ninformation should be observed. Always adhere to safe working\npractices and observe local regulations regarding health\nprotection, accident prevention and environmental protection.</p>\n\n<p class=\"bold\">Opel Speedster/Vauxhall VX220 Service Schedule:</p>\n\n<ul type=\"disc\">\n<li>Main service: every 15 000 km/10 000 miles or annually\nwhichever occurs first.</li>\n</ul>\n\n<p>For scheduled service operations which are performed on an\nirregular basis such as timing belt replacement are performed where\npossible in conjunction with the relevant Service Schedule.</p>\n\n<p>Each Service must be performed using the relevant Service\nSchedule/Service Check List. The fully completed check list must\nalways be handed to the customer together with the invoice. The\ncheck list used must correspond with the Schedule in the Service\nBooklet.</p>\n\n<p class=\"bold\">The following new features are especially\nnoteworthy:</p>\n\n<p>The scope of the work operations have been re-evaluated and the\nlabour times revised.</p>\n\n<p>The Z 20 LET Turbo engine is now included in the Speedster/VX220\nservice plan for the first time.</p>\n\n<p>A new operation: &ldquo;Timing belt and tension roller:\nreplace&rdquo;, has been included for the new Z 20 LET Turbo\nengine.</p>\n\n<p class=\"bold\">Time Allowances</p>\n\n<p>Contains the time allowance for the Service Schedule. In\nindividual cases, the specified time allowance may be either higher\nor lower than the actual value. These are the recommended values.\nThe time allowance for vehicle set-up \"Vehicle from Parking Place\nto Workplace and Back\" =&nbsp;.2&nbsp;hrs - is included in the\nspecified values and not given separately. The time allowances do\nnot include a specification for test drives. The time expenditure\nfor test drives - as for test drives after repair operations - is\ncovered by the regular workshop overhead rate.</p>\n\n<p>The time allowances are listed separately for the Service\nSchedule and additional items.</p>\n\n<p>Pneumatic wrenches are used for determining time allowances for\ndetaching wheel nuts/bolts.</p>\n\n<p>Time allowances for the service now include the use of power\ntools to remove and install the engine undertrays.</p>\n\n<p>Also, within the Additional Operation schedule, there are\noperations which are performed irregularly, e.g. replace timing\nbelt. The time allowances for the additional operations are not\nincluded in the Service and must be invoiced separately. We\nrecommend that, where possible, these operations be performed\nduring the Service as the time allowances are then considerably\nlower than when the operations are performed separately. This\napplies especially to the exhaust emissions test, which is no\nlonger included in the regular inspection.</p>\n\n<p class=\"bold\">Severe Operating Conditions</p>\n\n<p>Severe operating conditions include frequent cold starts,\nfrequent driving in stop and go traffic, use as a hire car, etc.,\nand frequent short-distance driving.</p>\n\n<p>Extreme, external environmental influences includes, areas with\na high degree of air pollution (drift sand), a high pollutant\nburden, large temperature variations, high humidity, etc.</p>\n\n<p>If the service reveals that the vehicle is operated under severe\noperating conditions or is subjected to extreme external\nenvironmental influences, the customer's attention must be drawn to\nthe necessity for more frequent servicing.</p>\n\n<p>Frequent city and short-distance driving more than triples the\nload on the engine oil and engine wear compared with intercity and\nmotorway driving. As a consequence, the performance of the engine\noil deteriorates and requires more frequent changing when used for\nshort-distance driving.</p>\n\n<p>An additional engine oil and filter change is recommended for\n\"normal mileage\" with frequent cold starts or mainly city or\nshort-distance driving. This must be confirmed by stamping the\nspecific fields in the Service Booklet.</p>\n\n<p class=\"bold\">Exhaust emissions test (AU)</p>\n\n<p>An exhaust emission test is not included in the Service Plan,\nhowever, it can be performed during a Service. The data required\nfor the exhaust emission test is listed in the Exhaust Emission\nTest brochure.</p>\n\n<p>For additional operations (trouble code read-out, circuit test,\nidle speeds etc.), refer to the corresponding Checking\nProcedures.</p>\n</td>\r\n  </tr>\r\n  \r\n  <tr>\r\n    <td ></td>\r\n  </tr>\r\n</table>\r\n</div>",
  "extractedData": {}
}