{
  "type": "tsb",
  "id": "headlamps-glas-misted-from-the-inside-A26D1C",
  "title": "Field Remedy: 1598",
  "subject": "Headlamps - Glas misted from the\ninside",
  "metadata": {
    "models": null,
    "engines": null,
    "functionalGroup": "N - Electrical Equipment",
    "complaintGroup": "10 - Leakage,12 - Misting",
    "troubleCode": "None"
  },
  "complaint": "Headlamp glas misted from inside",
  "cause": "Air moisture misting on the inside of\nheadlamp glas or headlamp leaky",
  "production": "None",
  "remedyContent": [
    {
      "type": "text",
      "text": "In case of customer complaint, the following items have to be checked\nto avoid unnecessary replacement of headlamps.\nIf there is fogging on the headlamp lens, also designated condensation\nbelow, the emergence surface on the lens, which is active as regards\nlighting technology, must be clear after traveling for approx. 20 minutes\nwith the dipped beam switched on.  The remaining surfaces of the lens can\nand may still be covered with condensation after this.\nIt should be noted when discussing the matter with customers that the time\npattern for the dissipation process for condensation is extremely dependent\non the temperature in the immediate area and the relative humidity of the\nair.  In a situation of this kind, AOAG will not accept the costs for\nreplacing headlamps.\nIf heavy condensation is present (drops forming on the lens) the covering\ncaps and seals on the headlamp casing must be checked and the lens should\nhave oil-free compressed air blown over it.  The effectiveness of the\nmeasures undertaken should be checked by further observation.\nIf water is penetrating into the headlamp via damaged seals, bonded joints\net cetera, the corresponding repairs should be undertaken (change seal,\nreplace headlamp, ...).\nIf headlamps, which prove to be in good order according to the manufacturer's\ntest stipulations, are submitted under the warranty, you may be charged for\nthem.  Please contact your national service center in problem situations."
    },
    {
      "type": "text",
      "text": "Aid for Argumentation:\nThe following description may be used as an aid to argumentation in discussions\nwith customers.\nAs a consequence of the open ventilation system, which is, however, protected\nfrom spray and which is needed for pressure compensation, different \"climate\nzones\" occur within the headlamp, resulting in fogging of the lens.  Thus, for\nexample, very warm areas occur in a headlamp with relatively cooler areas on\nthe other side.  The heating is generated by the heat emitted by the light\nsource, the cooling of the lens is caused primarily by the slipstream.  As a\nconsequence of the labyrinthine design of the ventilation apertures, expanding\nheated dry air is forced out of the headlamp casing.  After switching off the\nlight source, the air in the headlamp cools down slowly.  This causes air\nsaturated with moisture to be drawn from outside into the inside of the\nheadlamp casing.\nIn the presence of high humidity and high temperature differences between the\ninside of the housing and the environment, this situation can cause condensation\nto occur on the inside of the lens, especially in cold times of the year and in\ndamp weather.\nCondensation can occur, for example, after using a car wash, steam cleaning the\nengine and the front of the vehicle, if temperature changes occur during the\nnight, etc.\nEven the smallest imaginable moisture in the air inside the headlamp can be\nprecipitated on the lens, especially in the \"subsequent heating phase\", during\nwhich the back of the headlamp is heated because the engine is still warm, but\nat the same time the lens is being cooled down by cold outside air.  Since\nlenses with a clear glass appearance are now being used, which may also be\ntinted, this phenomenon is more obvious than on lenses with a structure.\nThe process involved in condensation in headlamps is caused by physics and\ndoes not affect the optical function of the headlamp (light output) in any way.\nNeither can the condensation cause any corrosion in the headlamp.\nThe phenomenon of condensation can occur on any headlamp, including those of\nour competitors, because it is caused by a physical process.  Changing the\nheadlamp is therefore unacceptable because no technical defect within the\nmeaning of the warranty is involved."
    }
  ]
}