{
  "type": "generic",
  "id": "lpg-draining-venting-and-purging-AQS315",
  "title": "lpg-draining-venting-and-purging-AQS315",
  "htmlContent": "<div class=\"content\">\n\r\n<table width=\"100%\" style=\"text-justify-trim:punctuation\">\r\n  <!--XPRINT-->\r\n  <table>\r\n  <tr>\r\n    <td></td>\r\n   <td>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</td>\r\n  \t\r\n  </tr>\r\n  </table>\r\n  \r\n  <!--/XPRINT-->\r\n  <tr>\r\n    <td >\r\n\r\n<div class=Section1>\r\n\r\n<p class=MsoNormal><b>LPG Draining, Venting and Purging</b></p>\r\n\r\n<p class=MsoNormal>&nbsp;</p>\r\n\r\n<p class=MsoNormal>Certain repairs will require the draining and purging of the\r\nLPG system.</p>\r\n\r\n<p class=MsoNormal>&nbsp;</p>\r\n\r\n<p class=MsoNormal><b>Hazards:</b></p>\r\n\r\n<h6 style='page-break-after:auto'><span style='font-family:\"Tms Rmn\"'>Bleeding\r\nthe system requires isolation of the LPG tank and purging the LPG by means of\r\nrunning the engine until the system switches to the Petrol mode, disconnection\r\nof any of the system components will result in a small amount of LPG being\r\nreleased into the atmosphere.</span></h6>\r\n\r\n<p class=MsoNormal>&nbsp;</p>\r\n\r\n<p class=MsoNormal>Draining of the system should be done by extraction using a\r\nLPG recovery and transfer pumping equipment only. This type of apparatus is\r\ncommercially available but if you require further information please consult\r\nyour Local Authority for guidance.</p>\r\n\r\n<p class=MsoNormal>&nbsp;</p>\r\n\r\n<p class=MsoNormal><b>Safety measures:</b></p>\r\n\r\n<p class=MsoNormal>Bleeding operations should be only done in a designated\r\nventilated area.</p>\r\n\r\n<p class=MsoNormal>&nbsp;</p>\r\n\r\n<p class=MsoNormal>The manufacturers safe working instructions for the pumping\r\nequipment must be followed at all times.</p>\r\n\r\n<p class=MsoNormal>&nbsp;</p>\r\n\r\n<p class=MsoNormal>Ensure the LPG is placed into suitable storage containers.</p>\r\n\r\n<p class=MsoNormal>&nbsp;</p>\r\n\r\n<p class=MsoNormal>When purging the system or tank, ensure after draining the\r\nsystem is drawn down to a negative pressure prior to the dried compressed air\r\nbeing introduced. Failure to draw down the system will result in the release of\r\nresidual LPG vapours.</p>\r\n\r\n<p class=MsoNormal>&nbsp;</p>\r\n\r\n<p class=MsoNormal><b>Ensure only qualified technicians work on this equipment,\r\nthey will have to be trained on correct isolation, draining and removal\r\nprocedures for fuel tanks and leak detection</b>.</p>\r\n\r\n<p class=MsoNormal>&nbsp;</p>\r\n\r\n<p class=MsoNormal><b>Ensure that vehicle repairs are carried out in areas with</b>\r\n<b>good ventilation</b>.</p>\r\n\r\n<p class=MsoNormal>&nbsp;</p>\r\n\r\n<p class=MsoNormal>When tasks have to be undertaken in a confined space, a\r\nsecond safety person should be present. They must observe the technician\r\nworking within the confined space from outside that area.</p>\r\n\r\n<p class=MsoNormal>&nbsp;</p>\r\n\r\n<p class=MsoNormal><b>Ensure that the LPG tanks do not become heated by\r\nprohibiting any welding or heat related repair processes near it, Under no\r\ncircumstances should a vehicle be placed in a spray / baking  booth and baked\r\nas part of a paint process. When these types of repair are necessary the LPG\r\nsystem requires purging and draining before removing the tank from the vehicle.\r\nRemoved tanks should not be left exposed to direct sunlight for long periods.\r\nThis is the same affect as baking in a paint booth.</b></p>\r\n\r\n<p class=MsoNormal>&nbsp;</p>\r\n\r\n<p class=MsoNormal>Storage of LPG tanks removed from the vehicle must conform\r\nto the highly flammable liquids and liquefied petroleum gases regulations 1972\r\nand the pressure systems and transportable gas containers regulations 1996.</p>\r\n\r\n<p class=MsoNormal>&nbsp;</p>\r\n\r\n<p class=MsoNormal>The local authority should be consulted regarding the siting\r\nof the storage area. Alternatively the LPG gas association code of practice 7,\r\nstorage of full and empty LPG cylinders and cartridges, provides a concise set\r\nof guidelines recommended by the HSE for use.</p>\r\n\r\n<p class=MsoNormal>&nbsp;</p>\r\n\r\n<p class=MsoNormal><b>For further information please consult our Dual Fuel\r\nVehicles / Safety Manual reference VA0001986 published in August 2000 </b></p>\r\n\r\n<p class=MsoNormal>&nbsp;</p>\r\n\r\n</div>\r\n\r\n</td>\r\n  </tr>\r\n  \r\n  <tr>\r\n    <td ></td>\r\n  </tr>\r\n</table>\r\n</div>",
  "extractedData": {}
}