{
  "type": "generic",
  "id": "safety-regulations-for-restraint-systems-AQS315",
  "title": "Safety Regulations for Restraint Systems",
  "htmlContent": "<div class=\"content\">\n\r\n<table width=\"100%\" >\r\n  <!--XPRINT-->\r\n  <table>\r\n  <tr>\r\n    <td></td>\r\n   <td>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</td>\r\n  \t\r\n  </tr>\r\n  </table>\r\n  \r\n  <!--/XPRINT-->\r\n  <tr>\r\n    <td >\n<p class=\"title\">Safety Regulations for Restraint Systems</p>\n\n<p class=\"topic\">13.1 General</p>\n\n<ul type=\"disc\">\n<li>Operations on restraint systems must be performed by trained\nand qualified personnel certified under the Explosives Act. This is\nassured at all Opel/Vauxhall affiliated dealerships.</li>\n\n<li>The restraint system incorporates the following\ncomponents:</li>\n\n<ul type=\"circle\">\n<li>Driver and passenger airbags (subsequently referred to as\ndriver and passenger airbags)</li>\n\n<li>Side airbag (subsequently referred to as side airbag)</li>\n\n<li>Curtain airbag (subsequently referred to as curtain\nairbag)</li>\n\n<li>Belt/belt buckle tensioner with seat belt</li>\n\n<li>Airbag control unit</li>\n\n<li>Decentralised front airbag sensor</li>\n\n<li>Decentralised side-airbag sensor</li>\n\n<li>Mounting plate for decentralised front airbag sensor</li>\n\n<li>Installation plate for decentralised side-airbag sensor</li>\n\n<li>Contact unit</li>\n\n<li>Steering Column Electronic Module / Column Integration Module\n(CIM)</li>\n\n<li>Wiring harness, with yellow or orange identification</li>\n\n<li>Sensor pad</li>\n\n<li>Airbag system indicator lights</li>\n\n<li>Indicator light for child safety seat with transponders</li>\n</ul>\n\n<li>The handling of pyrotechnic units (airbag and pyrotechnic seat\nbelt tensioners) is subject to varying national legislation which\nmust be observed at all times.</li>\n\n<li>The version with driver's airbag can be identified with the\n\"Airbag\" logo</li>\n\n<li>The version with passenger's airbag can be recognised by the\ninscription \"Airbag\" above the glove compartment and by the round\nchild seat warning sticker on the side of the instrument panel\n(passenger's door open) or by the rectangular warning sticker on\nthe sun visor.</li>\n\n<li>If, despite having a passenger's airbag fitted, there is no\nsticker at the corresponding point, this must be applied if there\nis no indication on the sun visor.</li>\n\n<li>The issue of loose warning stickers to final customers is not\npermissible.</li>\n\n<li>Versions with a side airbag can be recognised by the \"Airbag\"\nsticker on the outside of the front seat backrests. The inscription\nis engraved into the airbag cover (all cars, except Corsa-B). A\nmaterial label containing this inscription is stitched onto the\nfront seat backrest in the Corsa-B.</li>\n\n<li>The version with curtain airbag can be recognised by the\nlettering \"Airbag\" on the A and C-pillar panelling or the\nB-pillar.</li>\n\n<li>Service installation of accessories in the deployment area of\nthe airbag and storage of objects on the passenger's airbag cover\nis not permitted. Consoles for phone receivers, drink holders,\nCD/cassette trays, additional mirrors, etc., which have not been\nauthorised by Opel/Vauxhall may be torn off and propelled through\nthe passenger compartment when the airbag is deployed &ndash;\ndanger of injury.</li>\n\n<li>Objects (e.g. clothing) must kept away from the deployment area\nof the side airbag, as they may affect the functioning of the side\nairbag and be propelled through the passenger compartment &ndash;\ndanger of injury. Only use seat covers approved by Opel/Vauxhall\nfor the corresponding vehicle type with side airbag.</li>\n\n<li>Objects (e.g. clothing) must kept away from the deployment area\nof the curtain airbag, as they may affect the functioning of the\ncurtain airbag. Only light items of clothing with empty pockets and\nwithout coat hanger are permissible. Objects in the items of\nclothing may endanger the occupants if the curtain airbag is\ndeployed.</li>\n\n<li>The sale of pyrotechnic units is only permitted to authorised\nthird parties in accordance with explosives legislation.</li>\n\n<li>Components of the restraint system must never be interchanged\nor replaced by used parts.</li>\n\n<li>Repair work on restraint system components is not permitted.\nThese components must never be forced open or modified.</li>\n\n<li>The pyrotechnic units and airbag control unit are sensitive to\nimpact. They must not be installed if they have fallen from a\nheight exceeding 80 cm.</li>\n\n<li>Cables connected to gas generators for pyrotechnic units must\nnot be repaired, removed, replaced or cross-connected.</li>\n\n<li>The airbag units and the airbag control unit must not be\nsubjected to a temperature exceeding 85 &deg;C even for short\nperiods.</li>\n\n<li>Always disconnect the ground cable from the battery when\nperforming welding or soldering operations on the vehicle. Always\nattach the earth terminal of the welding equipment to the immediate\nvicinity of the welding point.</li>\n\n<li>For soldering or welding operations in the immediate vicinity\nof sensitive components (e.g. electrical/electronic/pyrotechnic\ncomponents, control units, wiring harnesses and airbags), the\ncomponents must be removed.</li>\n\n<li>For soldering or welding operations on front doors or door\npillars / B-pillars in the vicinity of the side airbag sensor\n(vehicle specific), this must be removed (store in a dry and safe\nplace). For minor installing or body operations (no use of, e.g.\nslide hammer) in this area, switching ignition OFF suffices. Remove\nthe ignition key and keep in a safe place during the repair\noperation.</li>\n</ul>\n\n<p class=\"topic\">13.2 Transportation and Storage</p>\n\n<ul type=\"disc\">\n<li>Pyrotechnic units may only be purchased, transported and\nstored, according to the safety regulations, by trained personnel\nof a franchised Opel/Vauxhall dealer or authorised Opel/Vauxhall\nService Dealership.</li>\n\n<li>Pyrotechnic units may be returned only if one of the following\nsix conditions has been fulfilled:</li>\n\n<ul type=\"circle\">\n<li>In accident-damaged vehicles that are not to be repaired and\npyrotechnic units that have not been deployed, an attempt must\nfirst be made to deploy the units in the vehicle with the relevant\nspecial service tools, as described in the Service Instructions.\nThese units must be returned as non-deployable pyrotechnic units\nonly following an unsuccessful ignition procedure. Local disposal\nof non-deployed pyrotechnic units is prohibited.</li>\n\n<li>Incorrect deliveries</li>\n\n<li>Electrical defect (e.g. as determined by diagnostic\ntester)</li>\n\n<li>Electromechanical defect (e.g. retaining lugs or on wiring\nharness plug housing damaged)</li>\n\n<li>Mechanical damage (e.g. if pyrotechnic unit has fallen from a\nheight exceeding 80 cm)</li>\n\n<li>Visual damage (e.g. cover panel scratched or damaged)</li>\n</ul>\n\n<li>The units may be returned in the original packaging only. If\nthis is not available, it must be ordered.</li>\n\n<li>The pyrotechnic units may be returned to the following address\nonly (the same address is applicable for procuring the original\npackaging):</li>\n\n<ul type=\"circle\">\n<li>Adam Opel GmbH,</li>\n\n<li>c/o Verpackungsservice Schollmayer GmbH,</li>\n\n<li>Am Kupferwerk 26,</li>\n\n<li>D-65462 Ginsheim-Gustavsburg,</li>\n\n<li>Germany</li>\n\n<li>\n<li>Telephone: +49 6134 2857-10</li>\n\n<li>Fax: +49 6134 2857-79</li>\n</ul>\n\n<li>For vehicle repairs requiring longer periods of time,\nnon-activated, removed airbags must be stored under lock and key.\nStorage with other hazardous materials (e.g. paint) is prohibited.\nThe storage area must identified with the corresponding hazard\nsymbol and contain suitable fire prevention equipment.</li>\n\n<li>Deployed pyrotechnic units can be disposed of as normal\nrefuse.</li>\n</ul>\n\n<p class=\"topic\">13.3 Registration</p>\n\n<ul type=\"disc\">\n<li>Until now, Aftersales parts have been accompanied by\nregistration cards and an envelope for registering replaced\nrestraint system components.</li>\n\n<li>As of now, filling out and returning the registration cards to\nAdam Opel GmbH, R&uuml;sselsheim is no longer necessary.</li>\n</ul>\n\n<p class=\"topic\">13.4 Diagnosis</p>\n\n<ul type=\"disc\">\n<li>If the pyrotechnic units are in perfect working order the\nairbag indicator lamp must illuminate when the ignition is switched\non and go off again after about four seconds. If the light does not\ngo off or it comes on whilst driving the vehicle, there is a\nfault.</li>\n\n<li>The system must only be tested using the diagnostic\ntester.</li>\n\n<li>During the diagnosis or programming of airbag systems, the\nfollowing sequence must be followed:</li>\n\n<ul type=\"circle\">\n<li>Ignition OFF</li>\n\n<li>Connect the diagnosis tester to the ALDL connector</li>\n\n<li>Ignition ON</li>\n\n<ul type=\"disc\">\n<li>Note: During diagnosis or programming (the period between\nswitching on and switching off the diagnostic tester) no persons\nare permitted in the vehicle.</li>\n</ul>\n\n<li>Switch on diagnosis tester</li>\n\n<li>Select system, follow menu</li>\n\n<li>De-select system</li>\n\n<ul type=\"disc\">\n<li>Note: If it is not possible to exit the \"Airbag\" menu the\nground cable must first be disconnected from the battery and the\nnegative terminal covered (exceptional case). Wait for one minute\nuntil the capacitor in the airbag control unit has discharged.</li>\n</ul>\n\n<li>Switch off diagnosis tester</li>\n\n<li>Ignition OFF</li>\n\n<li>Detach diagnosis tester from ALDL connector</li>\n</ul>\n\n<li>If there are no fault codes in the airbag system, a diagnosis\nin the vehicle (e.g. seat occupied detection test) is\npermitted.</li>\n\n<li>Vehicles with active fault codes must not be handed over to the\ncustomer &ndash; danger for occupants.</li>\n\n<li>In order to prevent unintentional deployment, never use a test\nlamp or multimeter to perform measurements on the pyrotechnic units\n&ndash; danger of injury.</li>\n\n<li>Connections for pyrotechnic units and control unit must be\ndisconnected when using test lamp or multimeter to check the wiring\nharness &ndash; danger of injury.</li>\n\n<li>If there is bodywork damage in the vicinity of the\ndecentralised front airbag sensors, inspect the securing panels and\nreplace if damaged.</li>\n\n<li>Testing with TECH2 (four test operations) and an Opel/Vauxhall\nchild safety cradle with transponders (part no. 09 121 858,\ncatalogue no. 17 46 704) is required whenever the passenger seat\nupholstery is replaced in vehicles with seat occupied detection <a\nhref=\"javascript:TFormSubmit('A8H81GZ71QU71','1','A8H81GZ71QU71','_top')\"><img src=\"/data/assets/images/6dfe3dad03d5.gif\"\nborder=\"0\" height=\"10\" width=\"20\" alt=\"LUREF_1.gif\"></a> .</li>\n\n<ul type=\"circle\">\n<li>If the test proves unsuccessful, the seat occupied detection is\nnot suitable for operation. The vehicle must not be handed over to\nthe customer.</li>\n\n<li>Exception: Driving is permitted for workshop staff, provided\nthat the passenger's seat remains unoccupied.</li>\n</ul>\n\n<li>Always replace damaged parts.</li>\n</ul>\n\n<ul type=\"disc\">\n<li>If only the pyrotechnic belt/belt lock tensioner are deployed\nin an accident, these must be replaced by new components.</li>\n\n<li>Control units may only be re-used if fault-free.</li>\n\n<li>Checking and replacing the seat belt system (seat belts with\nguide rollers and belt locks) after accident damage. The following\nthree different cases must be taken into account:</li>\n\n<ol type=\"a\">\n<li>Very slight accident damage: (minor accidents, e.g. parking\ndamage). No checks or replacements are necessary in these\ncases.</li>\n\n<li>Following minor accident damage (e.g. seat belt tensioner not\ndeployed) check ease of unwinding and check belt buckle operation;\nthere must be no damage to seat belt (e.g. tears, shiny areas\ncaused by overstretching) - otherwise replace affected component.\nThe same applies to Opel/ISO fixed belt systems, otherwise replace\naffected component. The same applies to child seat belt systems,\notherwise replace child seat.</li>\n\n<li>For other accident damage in general, replace respective seat\nbelt system that has been burdened by a person or child seat during\nan accident. Belt systems must also be replaced if it is\nsubsequently impossible to conclusively determine whether they were\nburdened. These measures must be carried out in all cases where a\nseat belt tensioner has been deployed or where side damage has\noccurred. The same applies to the Opel/ISO fixed belt system. The\nsame also applies to child seat belt systems. Otherwise replace the\nchild seat. Non-burdened seat belts should be tested as described\nin b).</li>\n</ol>\n\n<li>The airbag steering wheel may be replaced with steering wheels\napproved by Opel/Vauxhall only.</li>\n\n<li>Always put airbag units down with the padded side on top.</li>\n\n<li>Always transport or carry airbag units with the padded side\nfacing away from the body.</li>\n\n<li>The impact cushion of the steering wheel and the instrument\npanel padding must not be cemented or otherwise altered. Under no\ncircumstances may cleaning agents (aggressive materials) or grease\nbe used &ndash; clean with a dry or moistened cloth and using a\ncleaning agent approved by Opel/Vauxhall only.</li>\n\n<li>Before installation, check once more that the ground cable is\ndisconnected from the battery, the negative terminal is masked and\nthe ignition key is in the OFF position.</li>\n\n<li>After completing work on restraint systems, reconnect battery;\nno persons should be present in the vehicle.</li>\n\n<li>Disconnecting the ground cable from the battery automatically\nerases the contents of certain electronic system memories (e.g.\nelectric window winder, time and date). After reconnecting the\nground cable to the battery, these volatile memories must be\nreprogrammed and audio equipment decoded.</li>\n</ul>\n\n<p class=\"topic\">13.5 Deploying Pyrotechnic Units in the\nVehicle</p>\n\n<p>Deploy using provided special tool <span class=\n\"tool\">KM-799-B</span> and suitable adapter. Connect power source\nright at the end.</p>\n\n<ul type=\"disc\">\n<li>Park vehicle in open area.</li>\n\n<li>Before deployment of pyrotechnic units:</li>\n\n<ul type=\"circle\">\n<li>Ignition OFF</li>\n\n<li>Disconnect the ground cable from battery and mask the negative\nterminal.</li>\n\n<li>Wait for one minute until the capacitor in the airbag control\nunit has discharged.</li>\n</ul>\n\n<li>Remove all loose objects from the airbag deployment area.</li>\n\n<li>Vehicles with belt tensioners only: fasten seatbelt into belt\nlock.</li>\n\n<li>Connect special tool <span class=\"tool\">KM-799-B</span> to\nvehicle using suitable adapter.</li>\n\n<li>Open the front side windows and close the doors.</li>\n\n<li>Stand approx. 10 m in front of the vehicle &ndash; this also\napplies to uninvolved bystanders. Provide advance warning regarding\npotential noise level.</li>\n\n<li>Connect the voltage source and deploy the pyrotechnic\nunit.</li>\n\n<ul type=\"circle\">\n<li>Note: Disconnect the voltage source if the unit fails to deploy\nand approach the vehicle only after a period of 5 minutes. Further\ninformation is available in the section \"Transport and\nStorage\".</li>\n</ul>\n\n<li>Allow deployed airbag units to cool for 15 minutes before\nremoving &ndash; danger of injury.</li>\n</ul>\n</td>\r\n  </tr>\r\n  \r\n  <tr>\r\n    <td ></td>\r\n  </tr>\r\n</table>\r\n</div>",
  "extractedData": {
    "tools": [
      "KM-799-B"
    ]
  }
}