{
  "type": "generic",
  "id": "safety-regulations-for-clutches-gearboxes-A26D1C",
  "title": "Safety Regulations for Clutches, Gearboxes",
  "htmlContent": "<div class=\"content\">\n\r\n<table width=\"100%\" >\r\n  <!--XPRINT-->\r\n  <table>\r\n  <tr>\r\n    <td></td>\r\n   <td>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</td>\r\n  \t\r\n  </tr>\r\n  </table>\r\n  \r\n  <!--/XPRINT-->\r\n  <tr>\r\n    <td >\n<p class=\"title\">Safety Regulations for Clutches, Gearboxes</p>\n\n<p class=\"topic\">8.1 General</p>\n\n<ul type=\"disc\">\n<li>Before operations involving a risk of electrical short circuit,\nthe ground cable must be disconnected from the battery.</li>\n\n<li>Never pull on cable when disconnecting wiring harness plugs.\nCarefully release locking mechanism at wiring harness plug.</li>\n\n<li>During removal/installation of engine or transmission, it must\nbe ensured that all ground connections are correctly routed.\nStarting the engine with missing ground connections destroys the\ncontrol units.</li>\n\n<li>Always replace seals, seal rings, O-rings and retaining\nelements &ndash; do not overstretch retaining rings.</li>\n\n<li>During all transmission operations, ensure utmost cleanliness\nof components and tools to avoid transmission malfunction.</li>\n\n<li>Carefully clean all removed components and check for wear or\ndamage. Check grooves and seat surface for foreign objects, burr\nformation or damage.</li>\n\n<li>Only install housing components with sealing compound\ndesignated for this purpose.</li>\n\n<li>The Service Instructions list the transmission components which\nrequire coating with transmission fluid prior to installation.</li>\n\n<li>Insert bearings, gaskets and seal rings with assembly\ngrease.</li>\n\n<li>Bolted connections with designated angle of rotation specified\nin the Service Instructions (anti-fatigue bolts) must be replaced\nwith new parts if removed.</li>\n\n<li>The inner thread of screw connections that have been used with\nsealing compound must be recut and the outer thread cleaned. Use\nscrews with new sealing compound.</li>\n\n<li>Always replace self-locking nuts.</li>\n\n<li>If threads in aluminium components are stripped or damaged,\nthese parts are not necessarily unusable. In most cases these\nthreads can be repaired with commercially available Helicoil\ninserts.</li>\n\n<li>Only use approved special fluids &ndash; never re-use drained\nfluid.</li>\n\n<li>Disconnecting the ground cable from the battery automatically\nerases the contents of certain electronic system memories (e.g.\nelectric window winder, time and date). After reconnecting the\nground cable to the battery, these volatile memories must be\nreprogrammed and audio equipment decoded.</li>\n\n<li>When working on the hydraulic system, the utmost cleanliness\nmust be observed. The system is very sensitive to contamination.\nDirt particles cause function impairment, damage and destruction of\nthe hydraulic system. In addition, excessive wear may occur and\nsigns of wear may appear on components.</li>\n\n<li>If repairs cannot be carried out immediately, seal open\ncomponents or cover them carefully.</li>\n\n<li>The thread of screw connections that have been used with\nsealing compound must be recut. Coat screws with sealing compound\nbefore use.</li>\n\n<li>When replacing microencapsulated screws, there is no need for\nthe use of additional locking compounds when installing.</li>\n\n<li>Check all components for signs of wear and replace if\nnecessary.</li>\n\n<li>Place removed parts on clean surfaces only and cover with foil\n- never use lint-producing cloths.</li>\n\n<li>Only install clean parts. Remove new parts from their packaging\nimmediately prior to installation.</li>\n</ul>\n\n<p class=\"topic\">8.2 Clutch, clutch hydraulics</p>\n\n<ul type=\"disc\">\n<li>Friction surfaces of the clutch linings must not come into\ncontact with lubricants.</li>\n\n<li>Install clutch hoses and lines in the designated brackets.</li>\n\n<li>After working on the clutch hydraulics, evacuate and check all\nconnections for leaks.</li>\n\n<li>Brake fluid is a hazardous substance and must be treated,\nstored and identified accordingly.</li>\n\n<ul type=\"circle\">\n<li>Brake fluid is flammable &ndash; fire hazard.</li>\n\n<li>Explosive mixtures are easily formed from brake fluid\nfumes.</li>\n\n<li>Brake fluid is toxic &ndash; do not inhale brake fluid vapour\nor swallow brake fluid.</li>\n\n<li>Brake fluid can cause irritation of the skin &ndash; use rubber\ngloves.</li>\n\n<li>Escaping brake fluid must be rinsed away immediately with\nwater.</li>\n</ul>\n\n<li>Never re-use drained brake fluid.</li>\n\n<li>When disposing of brake fluid, never mix it with other\nsubstances (e.g. used oil). Observe national legislation\nguidelines.</li>\n\n<li>Before removing hydraulic system components, thoroughly clean\nconnections and their immediate vicinity.</li>\n\n<li>Lines must not be opened or released when the engine is\nrunning.</li>\n\n<li>All pressure lines must be tightened to the specified\ntorque.</li>\n</ul>\n\n<p class=\"topic\">8.3 Automatic Transmission</p>\n\n<ul type=\"disc\">\n<li>Always test the stall speed in AT vehicles. During the test,\nhigh drive forces are kept under control exclusively by the\nvehicle's brake system. This test may not be performed for longer\nthan a few seconds or otherwise the automatic transmission will\noverheat. Place brake wedges in front of and behind the drive\nwheels to secure the vehicle against rolling. Have a second person\nmonitor the wheels and brake wedges during the test.</li>\n\n<li>Before repairing the automatic transmission, always run a test\nusing the diagnostic tester in conjunction with the applicable\nChecking Procedures for the relevant transmission.</li>\n\n<li>If residual clutch lining, metal chips, soiling or deposits are\nfound in the transmission oil after repairing the transmission, the\ntransmission must be completely dismantled and carefully cleaned.\nBlow out all parts and oil channels and blow dry.</li>\n</ul>\n</td>\r\n  </tr>\r\n  \r\n  <tr>\r\n    <td ></td>\r\n  </tr>\r\n</table>\r\n</div>",
  "extractedData": {}
}