{
  "type": "generic",
  "id": "safety-regulations-for-gas-powered-vehicles-natural-gas-lpg--A26D1C",
  "title": "Safety regulations for gas-powered vehicles\n(natural gas / LPG liquid gas)",
  "htmlContent": "<div class=\"content\">\n\r\n<table width=\"100%\" >\r\n  <!--XPRINT-->\r\n  <table>\r\n  <tr>\r\n    <td></td>\r\n   <td>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</td>\r\n  \t\r\n  </tr>\r\n  </table>\r\n  \r\n  <!--/XPRINT-->\r\n  <tr>\r\n    <td >\n<p class=\"title\">Safety regulations for gas-powered vehicles\n(natural gas / LPG liquid gas)</p>\n\n<p class=\"topic\">7.1 General</p>\n\n<p>The following danger notes and safety regulations exclusively\napply to maintenance and repair work on Opel vehicles.</p>\n\n<p>Natural gas / liquid gas is a hazardous substance and must be\ntreated, stored and identified accordingly.</p>\n\n<ul type=\"disc\">\n<li>Natural gas is lighter than air and flows upwards when\nreleased.</li>\n\n<li>Liquid gas (LPG) is heavier than air and can collect in\ndepressions.</li>\n\n<li>In combination with air, both gases form an explosive,\nflammable mixture.</li>\n\n<li>Concentrated natural gas can cause suffocation.</li>\n\n<li>In most countries, an odour-producing agent is added to the gas\nin order to give the gas a more intensive smell. This typical gas\nsmell can be detected when the gas concentration is still well\nbelow the lower explosion limit (LEL). The odour-producing agent in\nthe gas does not pose a health hazard for the consumer.</li>\n</ul>\n\n<p>Natural gas-driven vehicles (CNG = Compressed Natural Gas) are\nrecognisable from the following features:</p>\n\n<ul type=\"disc\">\n<li>In the vehicle documents (vehicle title document, vehicle\nregistration papers), \"high-pressure gas\" will be entered as the\ntype of drive system. The vehicle is regarded as monovalent because\nan approximately 14 litre petrol tank is to be provided as an\nemergency supply tank.</li>\n\n<li>There are pressurised gas tanks, either individually or as a\nmodule, beneath the vehicle</li>\n\n<li>At the natural gas safety refuelling valve (TN1 combination)\nbehind the fuel tank cover.</li>\n\n<li>On a sticker for the operating materials in the fuel tank\ncap.</li>\n\n<li>Additional identification plate next to the standard vehicle\nidentification plate sticker on the B-pillar.</li>\n\n<ul type=\"circle\">\n<li>If, despite the fitting of gas storage equipment, there are no\nstickers in the appropriate places, these must be applied.</li>\n\n<li>On vehicles not driven by natural gas, these stickers must not\nbe present.</li>\n\n<li>The issuing of loose stickers to final customers is not\npermissible.</li>\n</ul>\n\n<li>From the logo \"1.6 CNG\", \"CNG\", \"eco M\", \"eco M turbo\",\n\"ecoflex\", \"ecoflex turbo\".</li>\n\n<li>Check Booklet in the additional Owner's Manual with the\non-board literature.</li>\n</ul>\n\n<p>Vehicles with liquid gas drive (LPG = Liquefied Petroleum Gas)\ncan be identified from the following features:</p>\n\n<ul type=\"disc\">\n<li>On the gas container or below the vehicle.</li>\n\n<li>On the filler valve behind the fuel tank cover.</li>\n\n<li>Additional identification plate next to the standard vehicle\nidentification plate sticker on the B-pillar.</li>\n\n<ul type=\"circle\">\n<li>If despite the integral gas system, there is no sticker at the\nappropriate points, the vehicle was probably converted after\nsale.</li>\n\n<li>The issuing of loose stickers to final customers is not\npermissible.</li>\n</ul>\n\n<li>From the logo \"ecoflex\", \"GPL-Tech\".</li>\n\n<li>Check Booklet in the additional Owner's Manual with the\non-board literature.</li>\n</ul>\n\n<p>Operating with explosive and flammable substances is subject to\nvarying national legislation which must be observed at all times.\nIt is essential that established technological regulations and the\nlegislation of the respective country are observed.</p>\n\n<p>Observe the relevant national regulations when handling and\ndisposing of hazardous substances (e.g. residual gas in the\npressurised gas tanks).</p>\n\n<p>At all workplaces in which hazardous substances are handled, the\ngeneral national handling regulations of the hazardous substances\nlegislation must be observed.</p>\n\n<p>Observe the relevant environmental, health and work safety\nregulations regarding explosive and flammable substances.</p>\n\n<p>In addition, the national legal requirements for other sectors\nsuch as accident prevention, hazardous substances legislation,\nhazardous goods, traffic and building regulations etc. must be\nobserved.</p>\n\n<p>Specific national legislation and guidelines for the respective\ncountry must be observed to ensure work safety.</p>\n\n<p>For the prevention of fire and explosive hazards in conjunction\nwith drilling, cutting, grinding or welding operations and material\nprocessing, the appropriate guidelines and regulations with regard\nto accident prevention issued by the specific national authorities\nmust be observed.</p>\n\n<p>When working on the gas system or the gas storage equipment,\nfire, naked flames, smoking and ignition sources are prohibited and\nsparks must not be generated. People's attention should be drawn to\nthis by placing hazard-warning signs in the gas system repair\narea.</p>\n\n<p>The prohibition of smoking must be clearly and permanently\nindicated by the presence of the relevant hazard-warning sign in\nthe workshop and at access points.</p>\n\n<p>When the gas system is being re-started it must be checked\nwhether the gas system and the pressurised gas tank are still\naccepted by the responsible authority (see gas container) and the\nmaximum permitted operating period has not been exceeded.</p>\n\n<p>If the testing deadline or the maximum operating period has been\nexceeded, the vehicle can continue to be used with the remaining\nsystem pressure, but must not be refuelled.</p>\n\n<p>If possible, it should be ensured that pressurised gas tanks\n(natural gas) with the same expiry period are installed.</p>\n\n<p>If a pressurised gas tank is found to be faulty or damaged so as\nto constitute a hazard for operators or third parties, it must be\nsafely discharged without delay. If this is not possible,\nalternative, suitable measures for hazard prevention must be\ntaken.</p>\n\n<p>When the gas system is filled, the information in the relevant\noperating instructions for the vehicle and the refuelling system\nmust be complied with. It must be checked whether the testing\ndeadlines or the maximum operating period for the pressurised gas\ntank have been reached or have expired.</p>\n\n<p>Avoid damage to gas system components such as the pressurised\ngas tank.</p>\n\n<p>In order to protect the filler valve from damage, water and\nsoiling, it must be closed again immediately after refuelling,\nemptying the gas system or carrying out leak testing.</p>\n\n<p>A completely or partially assembled system must not be left\nunsealed.</p>\n\n<p>The operation of CNG vehicles without gas storage systems is\nprohibited and results in the cancellation of type approval.</p>\n\n<p>In the event of injury or feeling unwell due to contact with\nhazardous substances, medical attention must be sought immediately.\nIf possible, the doctor must be informed of the type of hazardous\nsubstance involved.</p>\n\n<p>&nbsp;</p>\n\n<p class=\"topic\">7.2 Repair Information</p>\n\n<p>In the workshop, two separate working areas are required, in\nwhich specific demands are made upon work safety and equipment, due\nto the differing hazards which prevail:</p>\n\n<ul type=\"disc\">\n<li>Normal workshop area in which only maintenance and repair work\non non-gas-bearing vehicle components is performed.</li>\n\n<li>Special workplace for gas-driven vehicles in which repair work\non gas-bearing vehicle components is performed.</li>\n</ul>\n\n<p>Therefore, before commencing an operation, the type and scope of\nthe repair work must be checked. Before commencing an operation, it\nmust also be checked whether the suggested repair work is in\naccordance with the current technological standards for maintenance\nwork on the gas system.</p>\n\n<p>Gas-powered vehicles such as vehicles with gasoline engines can\nbe dealt with during normal maintenance and repair work (with the\nexception of work on the gas system). This does not apply to\nvehicles with a leaking gas system.</p>\n\n<p>Non-gas-related maintenance and repairs can also be performed by\nmechanics who have not had gas training if they have been\ninstructed by a skilled worker (member of staff with gas training)\nand the work has been accepted (inspected). However, the staff must\nbe aware of the relevant regulations and rules (BGR157, GUV17.1\netc.) and have been given instruction on special gas-specific\nfeatures.</p>\n\n<p>The following generally applies: maintenance and inspection work\non the gas system may only be carried out by trained and qualified\nstaff who have been given Opel gas service training in workshops\nset up for this purpose.</p>\n\n<p>Repair work on gas system components such as pressure reducers\nthat are not described in the service instructions is not\npermitted. These components must never be forced open or\nmodified.</p>\n\n<p>No holes may be drilled in the underbody area, from the interior\nof gas-driven vehicles. This is indicated by the stickers \"Caution,\ntank system: drilling / grinding prohibited\" in the vehicle\ninterior and on the cover for the pressurised gas tanks. If there\nare no stickers in the appropriate places, these must be\napplied.</p>\n\n<p>The pipe connections are manufactured to very fine tolerances.\nIn order to check the screw connections for correct fitting, a leak\ntest must be performed.</p>\n\n<p>Because a variety of different bolts and screws are used, make\nsure that you are using the correct ones. Do not mix them up.</p>\n\n<p>Before all work on gas-bearing components and screw\nconnections,</p>\n\n<ul type=\"disc\">\n<li>the main shut-off valve on all pressurised gas tanks must be\nclosed,</li>\n\n<li>residual pressure in the lines should be dissipated by running\nthe engine until it stops, if possible.</li>\n\n<ul type=\"circle\">\n<li>The lines are sufficiently discharged if, after several minutes\nof idling, the engine stops without the ignition being switched\noff</li>\n</ul>\n</ul>\n\n<p>Keep components of the gas system away from direct heat (e.g.\nincident solar radiation) and avoid temperatures in excess of 60\n&deg;C/122 &deg;F &ndash; risk of explosion.</p>\n\n<p>No repair operations in which temperatures in excess of 60\n&deg;C/140 &deg;F may be encountered (e.g. during paint drying in\nthe combined spray / drying plant or in the paint dryer) must be\nundertaken unless the vehicle's pressurised gas tanks have been\nremoved and the other gas system components completely discharged\nand flushed with inert gas.</p>\n\n<p>If it is necessary to flush the gas system, only inert gases may\nbe used which do not constitute an ignition hazard. An example of a\nsuitable inert gas is nitrogen.</p>\n\n<p>Gas system components such as the pressure reducer must never be\nsubjected to heat; the changes to the material properties that may\noccur can have a considerable effect on the operating safety of the\nvehicle. The gas system components must therefore not be thawed out\nusing an external heat source if they freeze up.</p>\n\n<p>Pressurised gas tanks, gas lines and all parts carrying gas must\nalways be removed if work is being carried out during which extreme\nheat will be generated such as cutting work, grinding work,\nsoldering work and welding work, working with hot air or cutting\ntorches etc. within a distance of 1 metre or less of these\nparts.</p>\n\n<p>All other gas system components must be completely discharged\nand flushed with inert gas.</p>\n\n<p>Never install connections with missing closures, or parts that\nhave been impregnated with dirt, grease or moisture. Never install\npipes, hoses and individual components unless the connections are\nin perfect condition.</p>\n\n<p>Gas system components which must be loosened or removed during\nrepair work must be properly refastened in their original positions\nusing genuine Aftersales parts (cable ties, clips, wiring trough\nbrackets, etc.). Particular care must be taken regarding proper\nrouting and secure connection of gas-bearing components.</p>\n\n<p>No other components must be fastened to gas lines, e.g.\nwiring.</p>\n\n<p>Before reusing the vehicle after repair work, the gas system\nmust always be subjected to a leak test, as described in the\nService Instructions.</p>\n\n<p>Following assembly, the natural gas system must not suddenly be\nsubjected to natural gas under full operating pressure from the\npressurised gas tanks, e.g. due to the opening of a solenoid valve.\nIt would then not be possible to find a leaking connection using\nthe usual leak-detecting sprays as, due to the high pressure of 200\nbar, the natural gas would blow away the leak-detecting medium from\nthe leak point without the formation of bubbles. Due to the high\npressure, leaks constitute an injury hazard.</p>\n\n<p>Furthermore, all gas system components must be subjected to a\nfunctional and visual check with regard to defects such as\ncontamination, deformation, formation of cracks, chafing, corrosion\nand other damage.</p>\n\n<p>As cut-off devices with actuators (solenoid valves) are used,\nthe switching function must be checked. The cut-off devices must\nclose automatically when the ignition is switched off\n(audible).</p>\n\n<p>Soiled parts must be cleaned and protected from ageing with\nsuitable anticorrosives if necessary (not oil).</p>\n\n<p>Vehicles in which leaks in the gas system have been detected\nmust not be handed over to the customer &ndash; danger of\nexplosion.</p>\n\n<p>Malfunctions or faults which are detected in the gas system must\nbe remedied immediately.</p>\n\n<p>Filling a natural gas-driven vehicle using a system without a\ngas dryer and without a filter is impermissible.</p>\n\n<p>Switch off the engine and the auxiliary heater before filling\nthe pressurised gas tank system. The vehicle to be filled must be\nprotected against rolling by engaging the parking brake.</p>\n\n<p><span class=\"gt-important\">Important:&nbsp;&nbsp;</span>\nServicing and repair work on the gas system is subject to mandatory\nregistration, see Section 7.6.</p>\n\n<p>Escaping gas can cause injury and freezing to parts of the body\nwith which it comes into contact. If necessary, suitable protective\nmeasures must be taken, such as the wearing of protective leather\ngloves.</p>\n\n<p>Appropriate warning signs must be set up during operations on\nthe gas system.</p>\n\n<p>Lift and support the vehicle at the designated jacking points\nonly. The jacking points on the body are vehicle-specific, are\nlisted in the Service Instructions in group \"A\" and must be\nobserved. It is not permissible to lift the vehicle at certain\ncomponents, e.g. pressurised gas tanks, carrier frame for\npressurised gas tanks etc., as slipping of the vehicle could cause\ndamage to the pressurised gas tanks or the high pressure lines.</p>\n\n<p>Spraying or other application of oil or lubricants in the\nvicinity of gas system components is prohibited &ndash; danger of\nexplosion.</p>\n\n<p>Utmost cleanliness must be ensured during operations on the gas\nsystem, especially with regard to the screw connections of\ngas-bearing components. The work must be performed with the utmost\ncare.</p>\n\n<p>For cleaning purposes, only use:</p>\n\n<ul type=\"disc\">\n<li>Clear water without cleaning additives</li>\n\n<li>Lint-free cloths</li>\n</ul>\n\n<p>Several operations require special service tools that may only\nbe utilised for the purpose specified in the Service Instructions.\nThe use of these tools ensures safe and technically reliable repair\nwork, as approved by Opel/Vauxhall.</p>\n\n<p>&nbsp;</p>\n\n<p class=\"topic\">7.3 Workplace</p>\n\n<p>Since the technical safety equipment of the maintenance areas is\ninadequate for working on the gas system with the release of gas\nthat may occur, vehicles with leaking gas systems must not be\nbrought into the maintenance area. These vehicles must be parked in\nthe open with adequate protection.</p>\n\n<p>Do not empty gas system components in confined working\nareas.</p>\n\n<p class=\"bold\">Action in an emergency:</p>\n\n<p>Vehicle with defective gas system at dealership: Vehicle remains\nin the open.</p>\n\n<p>If work must be carried out on the gas system itself, before\nbeginning any work ensure that no hazardous, explosive atmospheres\ncan arise in the work area (limit build-up). Always ensure that\nthere is adequate aeration and venting in the workshops.</p>\n\n<p>Adequate aeration means that the air in the work area must be\nexchanged at least 3 times per hour. However, the corresponding\nventing rate must be worked out by architects for each case. A\nwaiting period is stipulated for vehicles with damaged gas systems\nwhich have not been closed off. This waiting period is, as a\nminimum, the length of time it takes a gas system filled to maximum\nto drain. During this waiting period, the vehicle should be placed\nin the yard, on the area set aside and approved for the emptying of\ngas tanks.</p>\n\n<p>Suitable protective clothing must be worn when working.</p>\n\n<p class=\"bold\">Venting the natural gas:</p>\n\n<p>Venting the natural gas system into the open (venting the\nnatural gas) and inerting the natural gas system must be carried\nout on marked (e.g. cordoned off with tape) or separate open areas.\nMeasures must be taken to prevent electrostatic discharge. The\nleakage resistance of the floor must be &lt;10 <sup class=\n\"sup\">8</sup> Ohms. The area must be protected from lightning. An\nemptying ban during storms would be an alternative. No-one must go\nnear the vehicle during and just after emptying. All emptying must\ntake place with a cold engine/exhaust system. Ignition sources are\nprohibited within 5 metres of the blow-off source. This includes\nwork such as welding, cutting, disconnecting and hammering\nwork.</p>\n\n<p class=\"bold\">Draining liquid gas:</p>\n\n<p>There are various methods of tank drainage.</p>\n\n<table>\n<tr>\n<td class=\"list--arabic--number\" width=\"20\">1.</td>\n<td colspan=\"3\">Pump out the liquid gas with subsequent controlled\nburning of the gas phase.</td>\n</tr>\n\n<tr>\n<td class=\"list--arabic--number\" width=\"20\">2.</td>\n<td colspan=\"3\">Drain the liquid gas with subsequent blow-off of\nthe gas phase</td>\n</tr>\n\n<tr>\n<td class=\"list--arabic--number\" width=\"20\">3.</td>\n<td colspan=\"3\">Controlled burn of the liquid gas via a torch.</td>\n</tr>\n</table>\n\n<br>\n \n\n<p>In all methods, a safety zone must be set up which may vary. The\nplace for erection of the safety zone must be selected so that no\ngas can penetrate remote buildings, e.g. via open windows and\ndoors. The place must also be easily accessible and well\nventilated.</p>\n\n<p>When draining liquid gas, ensure that the place has a safety\nzone of at least 10 metres radius which may be extended if\nnecessary.</p>\n\n<p>The safety zone must be fenced off in a manner which is clear to\neveryone. The place must have no recesses or depressions as liquid\ngas can collect here.</p>\n\n<p>&nbsp;</p>\n\n<p class=\"topic\">7.4 Components</p>\n\n<p>Because type-approved parts are assigned to the vehicle by\nregistration number, gas system parts that require registration\nmust be documented in the vehicle's Check Booklet when they are\nreplaced. (see section 7.6 entitled Registration).</p>\n\n<p>Gas system components such as (e.g.) the pressure reducing\nvalve, are sensitive to impact. The installation of gas system\ncomponents which have fallen onto the ground is prohibited.</p>\n\n<p>Strict observance of the use of materials and additives (such as\napproved assembly pastes) is required for certain operations in the\nService Instructions.</p>\n\n<p>Only those replacement parts approved and released for the\nrelevant vehicle may be used in the gas system. This is assured by\nthe use of Opel/Vauxhall parts.</p>\n\n<p>Other parts may not be used, as these are not type approved and\nresult in the cancellation of the type approval.</p>\n\n<p>The connections of gas system components must be sealed\nimmediately after removal using tight-sealing closure caps.</p>\n\n<p>In warranty cases, returned components which have not been\nsealed cannot be accepted.</p>\n\n<p>Remove new parts from their packaging immediately prior to\ninstallation and check visually.</p>\n\n<p>&nbsp;</p>\n\n<p class=\"topic\">7.5 Transportation and Storage</p>\n\n<p>Pressurised gas tanks with carrier frames / gas tanks may only\nbe transported / returned if the following conditions are\nfulfilled:</p>\n\n<ul type=\"disc\">\n<li>The pressurised gas tanks must be emptied, depressurised and\ninerted.</li>\n\n<li>Before disposal, the shut-off device must be closed with a\nshut-off plug.</li>\n</ul>\n\n<p>The gas tanks in vehicles that have been involved in accidents\nand are not going to be repaired must be removed and disposed of in\naccordance with the stipulations of the country-specific laws.</p>\n\n<p>For vehicle repairs requiring longer periods of time, removed,\nnon-flushed pressurised gas tanks must be stored under lock and\nkey. Storage with other hazardous materials (e.g. paint) is\nprohibited. The storage area must identified with the corresponding\nhazard symbol and must be suitable for this purpose in accordance\nwith national legislation.</p>\n\n<p>The stipulations of national legislation and hazardous goods\nlegislation must be observed.</p>\n\n<p>For transportation by means of road vehicles, pressurised gas\ntanks must be stored in such a way that they cannot tip over, fall\noff or shift their position. For the transportation of pressurised\ngas tanks, only those lifting devices may be used which reliably\npreclude damage to, or dropping of the pressurised gas tanks.</p>\n\n<p class=\"bold\">Inerting the system</p>\n\n<p>The system which has been depressurised from its normal pressure\nis then pressurised once with nitrogen at a pressure of 15 bar and\ndischarged; it is then pressurised with nitrogen again in a second\ncycle, this time at a pressure of 10 bar, and discharged\n(depressurised) again.</p>\n\n<p>&nbsp;</p>\n\n<p class=\"topic\">7.6 Registration</p>\n\n<p class=\"bold\">All maintenance and repair work carried out on the\ngas system must be entered in the vehicle's Check Booklet.</p>\n\n<p>Continuous proof of conformance to all maintenance and repair\nschedules for the vehicle is required. Statutory legislation\nstipulates the storage of workshop documents for gas-powered\nvehicles over a period of 10 years. It must be ensured that this\ndata can be retrieved if required.</p>\n\n<p>The following registered components are installed in CNG-driven\nOpel vehicles:</p>\n\n<ul type=\"disc\">\n<li>Pressurised gas container</li>\n\n<li>Bottle safety valve</li>\n\n<li>Pressure reducing valve</li>\n</ul>\n\n<p>The following registered components are installed in LPG-driven\nOpel vehicles:</p>\n\n<ul type=\"disc\">\n<li>Liquid gas tank</li>\n\n<li>Multi-valve</li>\n\n<li>Pressure reducer / evaporator</li>\n\n<li>Injection unit</li>\n\n<li>LPG control unit</li>\n</ul>\n\n<p>Components that have to be registered bear an EU qualification\napproval number / ECE number.</p>\n\n<p>All work on the CNG gas system must be entered in the vehicle's\nCheck Booklet (additional instructions &ndash; monovalent plus\n&ndash; LPG / GPL) / service booklet.</p>\n\n<p>After installation of registered components, the dealer must\nenter the following information in the vehicle's Check Booklet:\nWhat was done; by whom; at what mileage reading; which registered\ncomponents were replaced.</p>\n\n<p class=\"para-before-table\">In principle, only gas components with\nan ECE approval may be fitted.</p>\n\n<table cellspacing=\"0\" cellpadding=\"2\" class=\"border-none\">\n<colgroup>\n<col width=\"41%\" align=\"left\">\n<col width=\"59%\" align=\"left\"></colgroup>\n\n<tr valign=\"top\">\n<td class=\"border-none\" rowspan=\"1\">\n<p>Liquid gas:</p>\n</td>\n<td class=\"border-none\" rowspan=\"1\">\n<p>ECE R67 ......</p>\n</td>\n</tr>\n\n<tr valign=\"top\">\n<td class=\"border-none\" rowspan=\"1\">\n<p>Natural Gas:</p>\n</td>\n<td class=\"border-none\" rowspan=\"1\">\n<p>ECE R110 ....</p>\n</td>\n</tr>\n</table>\n\n<br>\n</td>\r\n  </tr>\r\n  \r\n  <tr>\r\n    <td ></td>\r\n  </tr>\r\n</table>\r\n</div>",
  "extractedData": {}
}