{
  "type": "generic",
  "id": "time-allowances-general-A26D1C",
  "title": "Time Allowances - General",
  "htmlContent": "<div class=\"content\">\n\r\n<table width=\"100%\" >\r\n  <!--XPRINT-->\r\n  <table>\r\n  <tr>\r\n    <td></td>\r\n   <td>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</td>\r\n  \t\r\n  </tr>\r\n  </table>\r\n  \r\n  <!--/XPRINT-->\r\n  <tr>\r\n    <td >\n<p class=\"title\">Time Allowances - General</p>\n\n<p>For individual damage types, see section 2.1 \"Repairable\nDamage\", time allowances have been compiled according to the number\nof cables to be repaired or replaced.</p>\n\n<p>To determine the time allowances, the operation number for\nreplacing the wiring harness concerned is used in conjunction with\nTC: 87. TC: 87 here means a repair has been made.</p>\n\n<p>Before starting the repair, it must be estimated whether it is\nmore economical to repair than to replace the wiring harness. To do\nthis, use the time allowances listed in section 6.2.</p>\n\n<p>These only take into account the wiring harness repair itself.\nAny preparation work needed to expose areas for repair are not\nincluded in this and must be considered separately. For this\nreason, we ask you, as is also recommended for customer invoices,\nto list the time allowances given in section 6.2 plus those for the\npreparatory operations and compare them with the time allowances\nfor replacing the entire wiring harness.</p>\n\n<p>In warranty claims , the total time required (repair and\npreparatory operations) is submitted with TC: 87 under the\noperation number for the corresponding wring harness replacement,\nand the total time required for the repair must not exceed the time\nallowance for replacing the entire wiring harness. Slight amounts\nexceeding the time allowance must be approved by entering the\nvoluntary code \"Y\". When calculating the most cost-effective method\nin normal customer transactions , we recommend that the prices for\nwiring harness and repair kit are also included.</p>\n\n<p>The preparatory operations can be identified by normal main\noperation numbers.</p>\n</td>\r\n  </tr>\r\n  \r\n  <tr>\r\n    <td ></td>\r\n  </tr>\r\n</table>\r\n</div>",
  "extractedData": {}
}