{
  "type": "generic",
  "id": "axle-constructions-rear-axle-AQS315",
  "title": "Axle constructions - rear axle",
  "htmlContent": "<div class=\"content\">\n\r\n<table width=\"100%\" >\r\n  <!--XPRINT-->\r\n  <table>\r\n  <tr>\r\n    <td></td>\r\n   <td>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</td>\r\n  \t\r\n  </tr>\r\n  </table>\r\n  \r\n  <!--/XPRINT-->\r\n  <tr>\r\n    <td >\n<p class=\"title\">Axle constructions - rear axle</p>\n\n<p class=\"topic\">Rigid axle</p>\n\n<p>The rigid axle is characterised by very solid construction and\nhigh load-bearing capacity. With regard to driving behaviour and\ncomfort, other axle designs such as the torsion beam and multilink\nsuspension are far better. As the main advantage of this axle\ndesign is its load-bearing capacity, it is mainly used on goods\nvehicles. Another advantage is the low-cost production, and the\ntotally constant castor and camber alignment over the entire\ndriving distance.</p>\n\n<p class=\"topic\">Torsion-beam rear axle</p>\n\n<p>The torsion beam axle is another form of rigid axle. Torsion\nbeam axles include trailing arm axles which are often used on the\nrear in simple designs. In direct comparison with individual\nsuspension, the trailing axle has the advantage that it is more\neconomic to produce, takes up less space and still has excellent\ndriving behaviour.</p>\n\n<p>Trailing arm axles are particularly suitable for use of torsion\nbar springs or profiles, as the control arms can easily be\nconnected to the spring ends. More stable running is achieved with\ntrailing arms as the control arms pull the wheels on forward\nmotion.</p>\n\n<p class=\"topic\">Multi-link suspension</p>\n\n<p>Multilink axles are a form of individual suspension and try to\ncombine the benefits of trailing arm, semi-trailing arm and\nwishbone axles. On the Vectra-C, as well as the axle body this\nindividual suspension has a upper and lower wishbones, where only\nthe upper one is designed as an auxiliary control arm, and a\ntrailing arm on each side. In addition on the Vectra-C there is an\nantiroll bar and an auxiliary control arm at the bottom.</p>\n</td>\r\n  </tr>\r\n  \r\n  <tr>\r\n    <td ></td>\r\n  </tr>\r\n</table>\r\n</div>",
  "extractedData": {}
}