{
  "type": "generic",
  "id": "safety-regulations-for-electrical-electronic-systems-AQS315",
  "title": "Safety Regulations for Electrical/Electronic\nSystems",
  "htmlContent": "<div class=\"content\">\n\r\n<table width=\"100%\" >\r\n  <!--XPRINT-->\r\n  <table>\r\n  <tr>\r\n    <td></td>\r\n   <td>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</td>\r\n  \t\r\n  </tr>\r\n  </table>\r\n  \r\n  <!--/XPRINT-->\r\n  <tr>\r\n    <td >\n<p class=\"title\">Safety Regulations for Electrical/Electronic\nSystems</p>\n\n<p class=\"topic\">9.1 General</p>\n\n<ul type=\"disc\">\n<li>Never touch high-voltage-bearing components (e.g.: ignition\nsystem, xenon lamps) &ndash; can be fatal.</li>\n\n<li>Before disconnecting the ground cable from the battery in\nvehicles with alarm system and power sounder, disarm the power\nsounder. Disconnect the ground cable from the battery within 15\nseconds of switching off the ignition.</li>\n\n<li>If an alarm is unintentionally triggered via the power sounder,\nswitch on the ignition (battery connected) in order to override the\nalarm.</li>\n</ul>\n\n<p class=\"topic\">9.2 General Repair Information</p>\n\n<ul type=\"disc\">\n<li>When performing work where there is a danger of an electrical\nshort circuit, disconnect the earth cable from the battery. The\nfollowing procedure must be observed to avoid injury to persons and\ndamage to sensitive electrical components:</li>\n\n<ul type=\"circle\">\n<li>The battery terminals must be covered so that accidental\ncontact does not occur because the battery cable has gradually\nmoved backwards. This also prevents accidental contact during\nassembly, e.g. with bright metal components or tools.</li>\n\n<li>If individual connection cables forming part of the battery\nconnection have to be dismantled, always remove the earth clip on\nthe battery terminal first so that all the power circuits on the\nvehicle are free from voltage. Non-adherence to this ruling can\nlead to electronic components being damaged. Reconnection takes\nplace in reverse order, the earth clip is the last to be connected\nto the battery.</li>\n</ul>\n\n<li>Never connect/disconnect control unit or miscellaneous\nelectronic component wiring harness plugs with the ignition\nswitched on to avoid damaging the control units.</li>\n\n<li>Never pull on cable when disconnecting wiring harness plugs.\nCarefully release locking mechanism at wiring harness plug.</li>\n\n<li>When cleaning and contact sprays are being used, the\nmanufacturer's recommendations must be followed. Improper use can\ndamage sensitive electrical and electronic components.</li>\n\n<li>When returning a unit containing a CD unit (e.g. navigation\ncontrol unit, CD changer), remove all CD's to avoid damage to the\nlaser head or CD.</li>\n\n<li>To charge the battery, use a battery charger approved by\nService.</li>\n\n<li>When programming the control unit memory system, ensure that no\npersons are present in the interior - risk of injury!</li>\n\n<li>After completing repair operations, ensure that wiring harness\nconnections and battery connections are correctly seated and that\nground connections have been made correctly. Defective electrical\nconnections cause functional problems and destroy control\nunits.</li>\n\n<li>Wiring harnesses and wiring troughs which are released or\nremoved during repair work must be refastened in their original\npositions using genuine Aftersales parts (cable ties, clips, wiring\ntrough brackets, etc.).</li>\n\n<li>Disconnecting the ground cable from the battery automatically\nerases the contents of certain electronic system memories (e.g.\nelectric window winder, time and date). After reconnecting the\nground cable to the battery, these volatile memories must be\nreprogrammed and audio equipment decoded.</li>\n\n<ul type=\"circle\">\n<li>Only Corsa-C as of Model Year 2004 and Meriva-A: In vehicles\nwith ESP, the steering angle sensor must be recalibrated after\ndisconnecting the battery - switch ignition ON and turn steering\nwheel from the right to the left stop.</li>\n</ul>\n</ul>\n\n<p class=\"topic\">9.3 Wiring Harness Repair</p>\n\n<ul type=\"disc\">\n<li>Wiring harness repairs must be performed by certified,\nqualified personnel only. This is assured at all Opel/Vauxhall\naffiliated dealerships.</li>\n\n<li>Cables or wiring harness plugs may only be repaired using the\nmethods described in the service literature and using the special\ntools and spares specified. Deviations may be made from this rule\nin individual cases, e.g. in the course of roadside\nassistance.</li>\n\n<li>When repairing non-approved systems or wiring harnesses:</li>\n\n<ul type=\"circle\">\n<li>Shielded cables/coaxial cables e.g. for the ABS system/ ASC\nsystem, radio, telephone, engine, alarm system. An exception to\nthis rule are CAN-bus cables, which can be repaired in accordance\nwith KTA-1950/2, section D6.</li>\n\n<li>Airbag and pyrotechnic seat belt tensioner system</li>\n\n<li>Electronically controlled throttle valve</li>\n\n<li>Electric power steering system</li>\n\n<li>Electrical seat adjustment</li>\n\n<li>High-voltage-bearing cables (e.g. ignition system, xenon\nlamp)</li>\n</ul>\n</ul>\n\n<p class=\"topic\">9.4 Vehicle Battery</p>\n\n<ul type=\"disc\">\n<li>Fluid-filled vehicle batteries must only be stored and charged\nin well-ventilated areas. Gaseous hydrogen released when the\nbattery is charged is lighter than air and combines with air to\nform an explosive mixture. Avoid the formation of sparks, smoking\nand naked flames.</li>\n\n<li>If, on batteries fitted with a \"magic eye\", this is colourless\nor light yellow, the acid level is too low and overheating may\noccur during recharging &ndash; danger of explosion. Only charge\nundamaged batteries.</li>\n\n<li>To charge the battery, use a battery charger approved by\nService.</li>\n\n<li>The recommended battery acid temperature during charging is\nbetween 10 &deg;C/50 &deg;F and 30 &deg;C/86 &deg;F. Reduce the\ncharging current if the temperature exceeds 50 &deg;C/122 &deg;F\nand terminate charging if it exceeds 55 &deg;C/131 &deg;F. The\nbattery cannot be charged at temperatures below 0 &deg;C/32 &deg;F.\nThe temperature of the battery acid can be estimated from the\ntemperature of the battery casing.</li>\n\n<li>Electrolyte (sulphuric acid) escaping from vehicle batteries\ncan lead to serious acid burns &ndash; danger of injury. Escaping\nelectrolyte must be diluted and flushed away using large volumes of\nwater, soaked up with sawdust or with an absorbent cloth.</li>\n\n<li>Due to the quiescent current of control units (e.g. ATWS, radio\nunits), the battery may become discharged during long standing\nperiods (e.g. stored vehicles) &ndash; disconnect battery and\nrecharge if necessary.</li>\n</ul>\n\n<p class=\"topic\">9.5 Diagnosis</p>\n\n<ul type=\"disc\">\n<li>For testing purposes, use only a high-resistivity voltage\ntester.</li>\n\n<li>The pyrotechnic system (e.g. airbag) may only be tested using\nthe diagnostic tester. In order to prevent unintentional\ndeployment, never use a test lamp or multimeter to perform\nmeasurements on the pyrotechnic units &ndash; danger of\ninjury.</li>\n\n<li>The test operations during which wiring harness plug contacts\nor control units are connected to ground or the battery voltage\n(+12 V) must be performed with extreme care and concentration. A\nwrong contact can destroy internal circuits in the relevant control\nunits.</li>\n\n<li>The battery must be in good condition and adequately charged\nwhen performing diagnosis on electrical/electronic systems.</li>\n\n<li>Only suitable test probes may be used for measuring so as to\navoid damage to the contacts.</li>\n</ul>\n</td>\r\n  </tr>\r\n  \r\n  <tr>\r\n    <td ></td>\r\n  </tr>\r\n</table>\r\n</div>",
  "extractedData": {}
}