{
  "type": "generic",
  "id": "mobile-balancing-precision-balancing-A26D1C",
  "title": "Mobile Balancing (Precision Balancing)",
  "htmlContent": "<div class=\"content\">\n\r\n<table width=\"100%\" >\r\n  <!--XPRINT-->\r\n  <table>\r\n  <tr>\r\n    <td></td>\r\n   <td>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</td>\r\n  \t\r\n  </tr>\r\n  </table>\r\n  \r\n  <!--/XPRINT-->\r\n  <tr>\r\n    <td >\n<p class=\"title\">Mobile Balancing (Precision Balancing)</p>\n\n<p>After wheels have been installed on the vehicle, imbalances\ncould occur, usually causes by imbalances in rotating vehicle parts\n(wheel hub, brake drum or brake disc). To compensate this residual\nimbalance, balance the wheels on the vehicle with a mobile balancer\n(finish balancer or precision balancer).</p>\n\n<p>Electronic imbalance determination is performed using two\nrecorders (measuring stands) with integrated force sensors.</p>\n\n<p>The recording points should be on the axle body, as close as\npossible to the centre plane of the wheels. Always make sure that\nthere is a rigid metallic connection between the measuring stands\nand suspension, i.e. do not place the measuring stand under rubber\nbearings or shock absorber fastening lugs.</p>\n\n<p class=\"topic\">Caution !</p>\n\n<p>The wheels on the drive axle must be driven by the vehicle's own\nengine. The workplace must be equipped with an exhaust extraction\nunit. To prevent damage, ensure that precision balancing is only\nperformed using the special measuring stands and suitable\nadapters.</p>\n\n<p>Differing running speeds or directions can cause interruptions\nto the measurement procedure when precision balancers with\n\"infrared sensors and selective measuring procedures\" are used.</p>\n\n<p>Precision balancing of the rear wheels is always performed with\ntwo measuring stands. To prevent damage to the differential, the\nwheels may only be driven by the vehicle's engine.</p>\n\n<p>At the front axle, the wheel which is to be balanced must be\ndriven by the balancing equipment friction wheel in direction of\ntravel. If only one measuring stand is used, the opposite vehicle\nside does not have to be raised.</p>\n\n<p>Front and rear axle support: In each case under the swivel joint\nof the lower wishbone (use suitable adapter from balancer\nmanufacturer).</p>\n</td>\r\n  </tr>\r\n  \r\n  <tr>\r\n    <td ></td>\r\n  </tr>\r\n</table>\r\n</div>",
  "extractedData": {}
}