{
  "type": "generic",
  "id": "safety-regulations-for-braking-systems-A26D1C",
  "title": "Safety Regulations for Braking Systems",
  "htmlContent": "<div class=\"content\">\n\r\n<table width=\"100%\" >\r\n  <!--XPRINT-->\r\n  <table>\r\n  <tr>\r\n    <td></td>\r\n   <td>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</td>\r\n  \t\r\n  </tr>\r\n  </table>\r\n  \r\n  <!--/XPRINT-->\r\n  <tr>\r\n    <td >\n<p class=\"title\">Safety Regulations for Braking Systems</p>\n\n<p class=\"topic\">5.1 General</p>\n\n<ul type=\"disc\">\n<li>Operations on the brake system may be performed by certified,\nqualified personnel only. This is assured at all Opel/Vauxhall\naffiliated dealerships.</li>\n\n<li>Before operations involving a risk of electrical short circuit,\nthe ground cable must be disconnected from the battery.</li>\n\n<li>After completion of work on the brake system, braking\nefficiency must be checked before re-using the vehicle.</li>\n\n<li>Use of cover discs or brake dust guards is prohibited, as\notherwise overheating can cause the formation of bubbles in the\nbrake fluid and consequent brake system failure. In addition, the\nrubber sleeves in the brake callipers and wheel brake cylinders may\nbe destroyed.</li>\n</ul>\n\n<p class=\"topic\">5.2 Repair Information</p>\n\n<ul type=\"disc\">\n<li>When replacing brake discs, always install new brake linings.\nUse original Opel/Vauxhall brake linings. Always replace all brake\nlinings or brake shoes on one axle. After replacing brake linings,\nnotify the owner of the vehicle that unnecessary severe braking\nmust be avoided for the next 200 km.</li>\n\n<li>Material-removing work on the brake calliper pistons and bores\nis not permitted. Corroded pistons in the brake calliper may be\ncleaned with brake fluid or alcohol. No sharp-edged tools may be\nused in operations on these components.</li>\n\n<li>The thread of screw connections that have been used with\nsealing compound must be cleaned or recut. Use screws with sealing\ncompound.</li>\n\n<li>Do not perform machining operations, when overhauling brake\ncomponents. Only used approved assembly paste.</li>\n\n<li>Friction surfaces of brake pads, brake linings, brake discs and\nbrake drums must not come into contact with lubricants. Only use\nspecial brake cleaner from \"Aftersales\".</li>\n\n<li>There must be no dirt between brake disc and wheel hub when\ninstalling the brake disc. The contact surfaces must be even and\nfree from burrs.</li>\n\n<li>Install brake hoses in designated brackets &ndash; ensure\ncorrect, twist-free routing of the hoses.</li>\n\n<li>After working on the brake system hydraulics, evacuate and\ncheck all connections for leaks.</li>\n\n<li>Vehicles with ABS:</li>\n\n<ul type=\"circle\">\n<li>When welding in the immediate vicinity of control units,\ndisconnect wiring harness plugs and remove control units.</li>\n\n<li>ABS control units can be damaged at temperatures above 80\n&deg;C/176 &deg;F.</li>\n</ul>\n</ul>\n\n<p class=\"topic\">5.3 Brake Fluid</p>\n\n<ul type=\"disc\">\n<li>Brake fluid is a hazardous substance and must be treated,\nstored and identified accordingly.</li>\n\n<ul type=\"circle\">\n<li>Brake fluid is flammable &ndash; fire hazard.</li>\n\n<li>Explosive mixtures are easily formed from brake fluid\nfumes.</li>\n\n<li>Brake fluid is toxic &ndash; do not inhale brake fluid vapour\nor swallow brake fluid.</li>\n\n<li>Brake fluid can cause irritation of the skin &ndash; use rubber\ngloves.</li>\n\n<li>Escaping brake fluid must be rinsed away immediately with\nwater.</li>\n</ul>\n\n<li>Never re-use drained brake fluid.</li>\n\n<li>Brake fluid attacks paintwork.</li>\n\n<li>When disposing of brake fluid, never mix it with other\nsubstances (e.g. used oil). Observe national legislation\nguidelines.</li>\n</ul>\n</td>\r\n  </tr>\r\n  \r\n  <tr>\r\n    <td ></td>\r\n  </tr>\r\n</table>\r\n</div>",
  "extractedData": {}
}