{
  "type": "generic",
  "id": "safety-regulations-engine-fuel-and-exhaust-system-A26D1C",
  "title": "Safety regulations – engine, fuel and\nexhaust system",
  "htmlContent": "<div class=\"content\">\n\r\n<table width=\"100%\" >\r\n  <!--XPRINT-->\r\n  <table>\r\n  <tr>\r\n    <td></td>\r\n   <td>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</td>\r\n  \t\r\n  </tr>\r\n  </table>\r\n  \r\n  <!--/XPRINT-->\r\n  <tr>\r\n    <td >\n<p class=\"title\">Safety regulations &ndash; engine, fuel and\nexhaust system</p>\n\n<p class=\"topic\">6.1 General &ndash; Engine</p>\n\n<ul type=\"disc\">\n<li>Observe the relevant environmental, health and work safety\nregulations regarding explosive and flammable materials.</li>\n\n<li>Refrigerant vapours are heavier than air (in high\nconcentrations) &ndash; danger of suffocation.</li>\n\n<li>Refrigerant constitutes a health hazard if swallowed.</li>\n\n<li>During all operations in the engine compartment, remember that\nthe ventilator can switch on - risk of injury!</li>\n\n<li>The fuel system, including the fuel lines, must not be opened\nwhile the engine is running. Risk of fatal injury!</li>\n\n<li>Never touch high-voltage live components (e.g. ignition system)\nwith the engine running is prohibited &ndash; can be fatal.</li>\n\n<li>Before all operations involving a risk of electrical short\ncircuit, the ground cable must be disconnected from the battery.\nThis also applies if electrical welding is performed on the\nvehicle.</li>\n\n<li>Before disconnecting the ground cable from the battery in\nvehicles with alarm system and power sounder, disarm the power\nsounder. Disconnect the ground cable from the battery within 15\nseconds of switching off the ignition.</li>\n</ul>\n\n<p class=\"topic\">6.2 Repair Information &ndash; Engine</p>\n\n<ul type=\"disc\">\n<li>Disconnecting the ground cable from the battery automatically\nerases the contents of certain electronic system memories (e.g.\nelectric window winder, time and date). After reconnecting the\nground cable to the battery, these volatile memories must be\nreprogrammed and audio equipment decoded.</li>\n\n<ul type=\"circle\">\n<li>Only Corsa-C as of Model Year 2004 and Meriva-A: In vehicles\nwith ESP, the steering angle sensor must be recalibrated after\ndisconnecting the battery - switch ignition ON and turn steering\nwheel from the right to the left stop.</li>\n</ul>\n\n<li>Disconnect the battery from the on-board power supply before\ncharging or rapid charging. Never start the vehicle using a rapid\ncharger.</li>\n\n<li>Ensure correct seating of battery terminals.</li>\n\n<li>Wiring harnesses and wiring troughs which are released or\nremoved during repair work must be refastened in their original\npositions using genuine Aftersales parts (cable ties, clips, wiring\ntrough brackets, etc.).</li>\n\n<li>During removal/installation of engine or transmission, it must\nbe ensured that all ground connections are correctly routed. Poor\nground connections lead to malfunctions in the system and, in\nextreme cases, to the destruction of control units. Never\nconnect/disconnect control unit or miscellaneous electronic\ncomponent wiring harness plugs with the ignition switched on.</li>\n\n<li>When mounting components in a vice, always use protective jaws\nmade of soft metal.</li>\n\n<li>The thread of screw connections that have been used with\nsealing compound must be recut. Coat screws with sealing compound\nbefore use.</li>\n\n<li>When replacing microencapsulated self-locking screws, there is\nno need for the use of additional locking compounds when\ninstalling.</li>\n\n<li>Check all components for signs of wear and replace if\nnecessary.</li>\n\n<li>Place removed components on clean surfaces only and cover with\nfoil &ndash; never use lint-producing cloths. If repairs cannot be\ncarried out immediately, seal open components or cover them\ncarefully. Only install clean parts. Remove new parts from their\npackaging immediately prior to installation.</li>\n\n<li>To prevent damage to toothed-belt fabric, ensure that toothed\nbelt does not come into contact with coolant.</li>\n\n<li>The components of the engine are sensitive to shock and must\nnot be installed if damaged. This applies in particular to the\nthrottle valve body as severe malfunctions may be result if\ndamaged, e.g. by being dropped.</li>\n</ul>\n\n<p class=\"topic\">6.3 Repair instructions - high-pressure and direct\ninjection systems (petrol and diesel engines)</p>\n\n<ul type=\"disc\">\n<li>Always wear safety glasses.</li>\n\n<li>Extremely high pressure (up to 2000 bar) is present at the high\npressure system connections. Before opening or carrying out any\noperation on the high pressure system, ensure that the lines are\nnot pressurised.</li>\n\n<li>Lines must not be opened or released when the engine is\nrunning.</li>\n\n<li>When installing used or new high pressure system components,\nexisting seals must be renewed (e.g. injectors).</li>\n\n<li>Before opening the high-pressure fuel system, disconnect\nbattery and ensure that the high-pressure fuel system has\ndepressurized.</li>\n\n<li>Always check for leaks after opening the high-pressure\nsystem.</li>\n\n<li>The system is extremely sensitive to contamination. Dirt\nparticles cause functional impairment, damage and destruction of\nthe high pressure injection system. Furthermore, wearing of other\ncomponents may occur. Thus, utmost cleanliness must be ensured for\noperations on the fuel injection system.</li>\n\n<li>All fuel lines must be tightened to the specified torque.</li>\n</ul>\n\n<p class=\"topic\">6.4 General &ndash; Fuel System</p>\n\n<ul type=\"disc\">\n<li>Observe the relevant environmental, health and work safety\nregulations regarding explosive and flammable materials.</li>\n\n<li>Never drain fuel tanks over workshop pits. Fuel vapours settle\nat the bottom of the pit &ndash; danger of suffocation. Work on\nlifting ramps in adequately ventilated areas only.</li>\n\n<li>During all operations in the engine compartment, remember that\nthe ventilator can switch on - risk of injury!</li>\n\n<li>Never touch high-voltage live components (e.g. ignition system,\nxenon lamp) &ndash; can be fatal.</li>\n\n<li>Before operations involving a risk of electrical short circuit,\nthe ground cable must be disconnected from the battery. This also\napplies if electrical welding is performed on the vehicle.</li>\n\n<li>Before disconnecting the ground cable from the battery in\nvehicles with alarm system and power sounder, disarm the power\nsounder. Disconnect the ground cable from the battery within 15\nseconds of switching off the ignition.</li>\n\n<li>Appropriate warning signs must be set up during operations on\nthe fuel tank.</li>\n\n<li>Keep away from flames and naked lights when working on the fuel\nsystem and avoid ignition sources and sparks.</li>\n\n<li>Never fasten fuel lines to brake lines, movable components or\nsharp edges. Never fasten wiring to fuel lines.</li>\n</ul>\n\n<p class=\"topic\">6.5 General Repair Information &ndash; Fuel\nSystem</p>\n\n<p><span class=\"gt-important\">Important:&nbsp;&nbsp;</span> When\nworking on the fuel system, ensure that any escaping fuel is\ncaptured in suitable containers. Ensure that no engine or vehicle\ncomponents come into contact with escaping fuel. Dispose of escaped\nfuel immediately and clean contaminated components.</p>\n\n<ul type=\"disc\">\n<li>Reduce fuel pressure via test connector on fuel pressure gauge\nand collect escaping fuel in suitable container.</li>\n\n<li>Drain fuel tank using fuel refilling unit &ndash; see\n\"Opel/Vauxhall Workshop Equipment\" catalogue. Store drained fuel in\nsuitable, sealable containers.</li>\n\n<li>The utmost cleanliness is important when working on the open\nfuel system.</li>\n\n<li>Use special tool to change fuel filter &ndash; see \"Special\nTools\" catalogue.</li>\n\n<li>Before removing fuel system components, thoroughly clean\nconnections and their immediate vicinity. After detaching, the fuel\nlines must be securely sealed using the appropriate special service\ntool.</li>\n\n<li>Check that fuel and vacuum lines are correctly routed and\nfirmly attached. Avoid chafing.</li>\n\n<li>When installing fuel lines, ensure that they are not twisted or\npinched. Fuel lines must not be kinked.</li>\n\n<li>If repairs cannot be carried out immediately, seal open\ncomponents or cover them carefully.</li>\n\n<li>Check fuel system for leaks &ndash; escaping fuel must be\ndisposed of immediately.</li>\n</ul>\n\n<p class=\"topic\">6.6 General Repair Information &ndash; Exhaust\nSystem</p>\n\n<ul type=\"disc\">\n<li>Leaks (dead air) in the intake and exhaust system upstream from\nthe catalytic converter result in incorrect oxygen sensor\nmeasurements.</li>\n\n<li>Exercise utmost care during all operations on the secondary air\nsystem. Any leak in the secondary air system can cause damage to\nthe catalytic converter and/or engine.</li>\n\n<li>Protect oxygen sensor from effects of silicon.</li>\n\n<li>Do not clean the oxygen sensor with fuel or allow it to come\ninto contact with fuel.</li>\n\n<li>When re-using oxygen sensor, coat thread with special grease.\nThe thread of new oxygen sensors is already coated with special\ngrease.</li>\n\n<li>Install the exhaust system free of tension and aligned\naccording to the contours of the vehicle underbody.</li>\n\n<li>Check exhaust system for leaks.</li>\n\n<li>When replacing the exhaust system or individual components, use\nvehicle-approved parts only.</li>\n\n<li>Take necessary precautions when working on hot exhaust systems\n&ndash; danger of burning.</li>\n\n<li>When removing parts or the entire exhaust system, ensure that\nthe flexible pipe is not deflected by an angle exceeding 10&deg;.\nSuspend front exhaust pipe from underbody using suitable means when\nperforming removal operations if necessary.</li>\n</ul>\n</td>\r\n  </tr>\r\n  \r\n  <tr>\r\n    <td ></td>\r\n  </tr>\r\n</table>\r\n</div>",
  "extractedData": {}
}